<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Lecture-5---Part-1" data-toc-modified-id="Lecture-5---Part-1-1">Lecture 5 - Part 1</a></span><ul class="toc-item"><li><span><a href="#Introduction-to-Pandas" data-toc-modified-id="Introduction-to-Pandas-1.1">Introduction to Pandas</a></span></li><li><span><a href="#5.1-Pandas-Introduction-and-Uses" data-toc-modified-id="5.1-Pandas-Introduction-and-Uses-1.2">5.1 Pandas Introduction and Uses</a></span><ul class="toc-item"><li><span><a href="#5.1.1-What-is-Pandas?" data-toc-modified-id="5.1.1-What-is-Pandas?-1.2.1">5.1.1 What is Pandas?</a></span></li><li><span><a href="#5.1.2-Pandas-Basics" data-toc-modified-id="5.1.2-Pandas-Basics-1.2.2">5.1.2 Pandas Basics</a></span></li><li><span><a href="#5.1.2.1-Pandas-Data-Structures" data-toc-modified-id="5.1.2.1-Pandas-Data-Structures-1.2.3">5.1.2.1 Pandas Data Structures</a></span><ul class="toc-item"><li><span><a href="#Part-1-(Creating-Series-in-Pandas):" data-toc-modified-id="Part-1-(Creating-Series-in-Pandas):-1.2.3.1">Part 1 (Creating Series in Pandas):</a></span><ul class="toc-item"><li><span><a href="#Example-1.1-(Creating-Series-from-Python-Dictionary):" data-toc-modified-id="Example-1.1-(Creating-Series-from-Python-Dictionary):-1.2.3.1.1">Example 1.1 (Creating Series from Python Dictionary):</a></span></li><li><span><a href="#Example-1.2-(Creating-Series-from-NumPy-Array):" data-toc-modified-id="Example-1.2-(Creating-Series-from-NumPy-Array):-1.2.3.1.2">Example 1.2 (Creating Series from NumPy Array):</a></span></li><li><span><a href="#Example-1.3-(Creating-Series-from-Scalar-Value):" data-toc-modified-id="Example-1.3-(Creating-Series-from-Scalar-Value):-1.2.3.1.3">Example 1.3 (Creating Series from Scalar Value):</a></span></li><li><span><a href="#Example-1.4-(Using-the-Series-Name-Attribute):" data-toc-modified-id="Example-1.4-(Using-the-Series-Name-Attribute):-1.2.3.1.4">Example 1.4 (Using the Series Name Attribute):</a></span></li><li><span><a href="#Problem-1:" data-toc-modified-id="Problem-1:-1.2.3.1.5">Problem 1:</a></span></li></ul></li><li><span><a href="#Part-2-(Creating-DataFrames-in-Pandas):" data-toc-modified-id="Part-2-(Creating-DataFrames-in-Pandas):-1.2.3.2">Part 2 (Creating DataFrames in Pandas):</a></span><ul class="toc-item"><li><span><a href="#Example-2.1-(Creating-DataFrames-from-Dictionaries):" data-toc-modified-id="Example-2.1-(Creating-DataFrames-from-Dictionaries):-1.2.3.2.1">Example 2.1 (Creating DataFrames from Dictionaries):</a></span></li><li><span><a href="#Example-2.2-(Creating-DataFrames-from-NumPy-Arrays):" data-toc-modified-id="Example-2.2-(Creating-DataFrames-from-NumPy-Arrays):-1.2.3.2.2">Example 2.2 (Creating DataFrames from NumPy Arrays):</a></span></li><li><span><a href="#Example-2.3-(Creating-DataFrames-from-Series-Objects):" data-toc-modified-id="Example-2.3-(Creating-DataFrames-from-Series-Objects):-1.2.3.2.3">Example 2.3 (Creating DataFrames from Series Objects):</a></span></li><li><span><a href="#Example-2.4-(Creating-DataFrames-from-other-DataFrames):" data-toc-modified-id="Example-2.4-(Creating-DataFrames-from-other-DataFrames):-1.2.3.2.4">Example 2.4 (Creating DataFrames from other DataFrames):</a></span></li><li><span><a href="#Example-2.5-(Creating-DataFrames-from-List-of-Dictionaries):" data-toc-modified-id="Example-2.5-(Creating-DataFrames-from-List-of-Dictionaries):-1.2.3.2.5">Example 2.5 (Creating DataFrames from List of Dictionaries):</a></span></li><li><span><a href="#Example-2.6-(Creating-DataFrames-from-CSV):" data-toc-modified-id="Example-2.6-(Creating-DataFrames-from-CSV):-1.2.3.2.6">Example 2.6 (Creating DataFrames from CSV):</a></span></li><li><span><a href="#Problem-2:" data-toc-modified-id="Problem-2:-1.2.3.2.7">Problem 2:</a></span></li></ul></li></ul></li><li><span><a href="#5.1.2.2-Inspecting-Pandas-Data-Structures" data-toc-modified-id="5.1.2.2-Inspecting-Pandas-Data-Structures-1.2.4">5.1.2.2 Inspecting Pandas Data Structures</a></span><ul class="toc-item"><li><span><a href="#Part-1-(Inspecting-Pandas-Series):" data-toc-modified-id="Part-1-(Inspecting-Pandas-Series):-1.2.4.1">Part 1 (Inspecting Pandas Series):</a></span><ul class="toc-item"><li><span><a href="#Example-1.1-(Dimensions):" data-toc-modified-id="Example-1.1-(Dimensions):-1.2.4.1.1">Example 1.1 (Dimensions):</a></span></li><li><span><a href="#Example-1.2-(Row-Labels):" data-toc-modified-id="Example-1.2-(Row-Labels):-1.2.4.1.2">Example 1.2 (Row Labels):</a></span></li><li><span><a href="#Example-1.3-(Name-Labels):" data-toc-modified-id="Example-1.3-(Name-Labels):-1.2.4.1.3">Example 1.3 (Name Labels):</a></span></li><li><span><a href="#Example-1.4-(Data-Values):" data-toc-modified-id="Example-1.4-(Data-Values):-1.2.4.1.4">Example 1.4 (Data Values):</a></span></li><li><span><a href="#Example-1.5-(Data-Type):" data-toc-modified-id="Example-1.5-(Data-Type):-1.2.4.1.5">Example 1.5 (Data Type):</a></span></li><li><span><a href="#Example-1.6-(Data-Quick-Look):" data-toc-modified-id="Example-1.6-(Data-Quick-Look):-1.2.4.1.6">Example 1.6 (Data Quick Look):</a></span></li><li><span><a href="#Example-1.7-(Data-Summary):" data-toc-modified-id="Example-1.7-(Data-Summary):-1.2.4.1.7">Example 1.7 (Data Summary):</a></span></li></ul></li><li><span><a href="#Side-Work:-Working-with-CSV-files-and-JSON-Data" data-toc-modified-id="Side-Work:-Working-with-CSV-files-and-JSON-Data-1.2.4.2">Side Work: Working with CSV files and JSON Data</a></span><ul class="toc-item"><li><span><a href="#Reader-Objects" data-toc-modified-id="Reader-Objects-1.2.4.2.1">Reader Objects</a></span></li><li><span><a href="#Reading-with-a-For-Loop" data-toc-modified-id="Reading-with-a-For-Loop-1.2.4.2.2">Reading with a For Loop</a></span></li><li><span><a href="#Writing-and-Editing-CSV-Files" data-toc-modified-id="Writing-and-Editing-CSV-Files-1.2.4.2.3">Writing and Editing CSV Files</a></span></li></ul></li><li><span><a href="#Part-2-(Inspecting-Pandas-DataFrames):" data-toc-modified-id="Part-2-(Inspecting-Pandas-DataFrames):-1.2.4.3">Part 2 (Inspecting Pandas DataFrames):</a></span><ul class="toc-item"><li><span><a href="#Example-2.1-(Dimensions):" data-toc-modified-id="Example-2.1-(Dimensions):-1.2.4.3.1">Example 2.1 (Dimensions):</a></span></li><li><span><a href="#Example-2.2-(Row-Labels):" data-toc-modified-id="Example-2.2-(Row-Labels):-1.2.4.3.2">Example 2.2 (Row Labels):</a></span></li><li><span><a href="#Example-2.3-(Column-Labels):" data-toc-modified-id="Example-2.3-(Column-Labels):-1.2.4.3.3">Example 2.3 (Column Labels):</a></span></li><li><span><a href="#Example-2.4-(Data-Values):" data-toc-modified-id="Example-2.4-(Data-Values):-1.2.4.3.4">Example 2.4 (Data Values):</a></span></li><li><span><a href="#Example-2.5-(Data-Type):" data-toc-modified-id="Example-2.5-(Data-Type):-1.2.4.3.5">Example 2.5 (Data Type):</a></span></li><li><span><a href="#Example-2.6-(Data-Quick-Look):" data-toc-modified-id="Example-2.6-(Data-Quick-Look):-1.2.4.3.6">Example 2.6 (Data Quick Look):</a></span></li><li><span><a href="#Example-2.7-(Data-Summary):" data-toc-modified-id="Example-2.7-(Data-Summary):-1.2.4.3.7">Example 2.7 (Data Summary):</a></span></li><li><span><a href="#Example-2.8-(Info):" data-toc-modified-id="Example-2.8-(Info):-1.2.4.3.8">Example 2.8 (Info):</a></span></li><li><span><a href="#Problem-3:" data-toc-modified-id="Problem-3:-1.2.4.3.9">Problem 3:</a></span></li></ul></li></ul></li><li><span><a href="#5.1.3-Indexing-Pandas-Data-Structures:" data-toc-modified-id="5.1.3-Indexing-Pandas-Data-Structures:-1.2.5">5.1.3 Indexing Pandas Data Structures:</a></span><ul class="toc-item"><li><span><a href="#Part-1-(Indexing-Method-1---Select-by-Column-Name):" data-toc-modified-id="Part-1-(Indexing-Method-1---Select-by-Column-Name):-1.2.5.1">Part 1 (Indexing Method 1 - Select by Column Name):</a></span><ul class="toc-item"><li><span><a href="#Example-1.1-(Access-1-Column-by-Name---Method-1):" data-toc-modified-id="Example-1.1-(Access-1-Column-by-Name---Method-1):-1.2.5.1.1">Example 1.1 (Access 1 Column by Name - Method 1):</a></span></li><li><span><a href="#Example-1.2-(Access-1-Column-by-Name---Method-2):" data-toc-modified-id="Example-1.2-(Access-1-Column-by-Name---Method-2):-1.2.5.1.2">Example 1.2 (Access 1 Column by Name - Method 2):</a></span></li><li><span><a href="#Example-1.3-(Access-2-Columns-by-Names):" data-toc-modified-id="Example-1.3-(Access-2-Columns-by-Names):-1.2.5.1.3">Example 1.3 (Access 2 Columns by Names):</a></span></li></ul></li><li><span><a href="#Part-2-(Indexing-Method-2---Select-by-Label):" data-toc-modified-id="Part-2-(Indexing-Method-2---Select-by-Label):-1.2.5.2">Part 2 (Indexing Method 2 - Select by Label):</a></span><ul class="toc-item"><li><span><a href="#Example-2.1-(Access-with-Single-Label---Series):" data-toc-modified-id="Example-2.1-(Access-with-Single-Label---Series):-1.2.5.2.1">Example 2.1 (Access with Single Label - Series):</a></span></li><li><span><a href="#Example-2.2-(Access-with-Single-Label---DataFrame):" data-toc-modified-id="Example-2.2-(Access-with-Single-Label---DataFrame):-1.2.5.2.2">Example 2.2 (Access with Single Label - DataFrame):</a></span></li><li><span><a href="#Example-2.3-(Access-with-List-of-Labels---Series):" data-toc-modified-id="Example-2.3-(Access-with-List-of-Labels---Series):-1.2.5.2.3">Example 2.3 (Access with List of Labels - Series):</a></span></li><li><span><a href="#Example-2.4-(Access-with-List-of-Labels---DataFrame):" data-toc-modified-id="Example-2.4-(Access-with-List-of-Labels---DataFrame):-1.2.5.2.4">Example 2.4 (Access with List of Labels - DataFrame):</a></span></li><li><span><a href="#Example-2.5-(Access-with-Slice-Object---Series):" data-toc-modified-id="Example-2.5-(Access-with-Slice-Object---Series):-1.2.5.2.5">Example 2.5 (Access with Slice Object - Series):</a></span></li><li><span><a href="#Example-2.6-(Access-with-Slice-Object---DataFrame):" data-toc-modified-id="Example-2.6-(Access-with-Slice-Object---DataFrame):-1.2.5.2.6">Example 2.6 (Access with Slice Object - DataFrame):</a></span></li><li><span><a href="#Example-2.7-(Access-with-Boolean-Array---Series):" data-toc-modified-id="Example-2.7-(Access-with-Boolean-Array---Series):-1.2.5.2.7">Example 2.7 (Access with Boolean Array - Series):</a></span></li><li><span><a href="#Example-2.8-(Access-with-Boolean-Array---DataFrame):" data-toc-modified-id="Example-2.8-(Access-with-Boolean-Array---DataFrame):-1.2.5.2.8">Example 2.8 (Access with Boolean Array - DataFrame):</a></span></li><li><span><a href="#Example-2.9-(Access-Scalar-Values):" data-toc-modified-id="Example-2.9-(Access-Scalar-Values):-1.2.5.2.9">Example 2.9 (Access Scalar Values):</a></span></li></ul></li><li><span><a href="#Part-3-(Indexing-Method-3---Select-by-Integer-Location):" data-toc-modified-id="Part-3-(Indexing-Method-3---Select-by-Integer-Location):-1.2.5.3">Part 3 (Indexing Method 3 - Select by Integer Location):</a></span><ul class="toc-item"><li><span><a href="#Example-3.1-(-Access-with-Integer---Series):" data-toc-modified-id="Example-3.1-(-Access-with-Integer---Series):-1.2.5.3.1">Example 3.1 ( Access with Integer - Series):</a></span></li><li><span><a href="#Example-3.2-(Access-with-Integer---DataFrame):" data-toc-modified-id="Example-3.2-(Access-with-Integer---DataFrame):-1.2.5.3.2">Example 3.2 (Access with Integer - DataFrame):</a></span></li><li><span><a href="#Example-3.3-(Access-with-List-of-Integers---Series):" data-toc-modified-id="Example-3.3-(Access-with-List-of-Integers---Series):-1.2.5.3.3">Example 3.3 (Access with List of Integers - Series):</a></span></li><li><span><a href="#Example-3.4-(Access-with-List-of-Integers---DataFrame):" data-toc-modified-id="Example-3.4-(Access-with-List-of-Integers---DataFrame):-1.2.5.3.4">Example 3.4 (Access with List of Integers - DataFrame):</a></span></li><li><span><a href="#Example-3.5-(Access-with-Slice-Object---Series):" data-toc-modified-id="Example-3.5-(Access-with-Slice-Object---Series):-1.2.5.3.5">Example 3.5 (Access with Slice Object - Series):</a></span></li><li><span><a href="#Example-3.6-(Access-with-Slice-Object---DataFrame):" data-toc-modified-id="Example-3.6-(Access-with-Slice-Object---DataFrame):-1.2.5.3.6">Example 3.6 (Access with Slice Object - DataFrame):</a></span></li><li><span><a href="#Example-3.7-(Access-with-Boolean-Array---Series):" data-toc-modified-id="Example-3.7-(Access-with-Boolean-Array---Series):-1.2.5.3.7">Example 3.7 (Access with Boolean Array - Series):</a></span></li><li><span><a href="#Example-3.8-(Access-with-Boolean-Array---DataFrame):" data-toc-modified-id="Example-3.8-(Access-with-Boolean-Array---DataFrame):-1.2.5.3.8">Example 3.8 (Access with Boolean Array - DataFrame):</a></span></li><li><span><a href="#Example-3.9-(Access-Scalar-Values):" data-toc-modified-id="Example-3.9-(Access-Scalar-Values):-1.2.5.3.9">Example 3.9 (Access Scalar Values):</a></span></li><li><span><a href="#Problem-4:" data-toc-modified-id="Problem-4:-1.2.5.3.10">Problem 4:</a></span></li></ul></li><li><span><a href="#Part-4-(Indexing-Method-4---Slicing-Ranges):" data-toc-modified-id="Part-4-(Indexing-Method-4---Slicing-Ranges):-1.2.5.4">Part 4 (Indexing Method 4 - Slicing Ranges):</a></span><ul class="toc-item"><li><span><a href="#Example-4.1-(Slicing-Ranges---Series):" data-toc-modified-id="Example-4.1-(Slicing-Ranges---Series):-1.2.5.4.1">Example 4.1 (Slicing Ranges - Series):</a></span></li><li><span><a href="#Example-4.2-(Slicing-Ranges---DataFrames):" data-toc-modified-id="Example-4.2-(Slicing-Ranges---DataFrames):-1.2.5.4.2">Example 4.2 (Slicing Ranges - DataFrames):</a></span></li></ul></li><li><span><a href="#Part-5-(Indexing-Method-5---Boolean-Indexing):" data-toc-modified-id="Part-5-(Indexing-Method-5---Boolean-Indexing):-1.2.5.5">Part 5 (Indexing Method 5 - Boolean Indexing):</a></span><ul class="toc-item"><li><span><a href="#Example-5.1-(Boolean-Indexing---Series):" data-toc-modified-id="Example-5.1-(Boolean-Indexing---Series):-1.2.5.5.1">Example 5.1 (Boolean Indexing - Series):</a></span></li><li><span><a href="#Example-5.2-(Boolean-Indexing---DataFrames):" data-toc-modified-id="Example-5.2-(Boolean-Indexing---DataFrames):-1.2.5.5.2">Example 5.2 (Boolean Indexing - DataFrames):</a></span></li><li><span><a href="#Problem-5:" data-toc-modified-id="Problem-5:-1.2.5.5.3">Problem 5:</a></span></li></ul></li></ul></li></ul></li></ul></li><li><span><a href="#Part-6-(Indexing-Method-6---Using-isin):" data-toc-modified-id="Part-6-(Indexing-Method-6---Using-isin):-2">Part 6 (Indexing Method 6 - Using isin):</a></span><ul class="toc-item"><li><ul class="toc-item"><li><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#Example-6.1-(Using-isin---Series):" data-toc-modified-id="Example-6.1-(Using-isin---Series):-2.0.0.0.1">Example 6.1 (Using isin - Series):</a></span></li><li><span><a href="#Example-6.2-(Using-isin---DataFrames):" data-toc-modified-id="Example-6.2-(Using-isin---DataFrames):-2.0.0.0.2">Example 6.2 (Using isin - DataFrames):</a></span></li></ul></li></ul></li><li><span><a href="#5.1.4-Manipulating-Pandas-Data-Structures:" data-toc-modified-id="5.1.4-Manipulating-Pandas-Data-Structures:-2.0.1">5.1.4 Manipulating Pandas Data Structures:</a></span></li><li><span><a href="#5.1.4.1-Simple-Manipulation-of-Pandas-Data-Structures:" data-toc-modified-id="5.1.4.1-Simple-Manipulation-of-Pandas-Data-Structures:-2.0.2">5.1.4.1 Simple Manipulation of Pandas Data Structures:</a></span><ul class="toc-item"><li><span><a href="#Part-1-(Setting-Values):" data-toc-modified-id="Part-1-(Setting-Values):-2.0.2.1">Part 1 (Setting Values):</a></span><ul class="toc-item"><li><span><a href="#Example-1.1-(Setting-Values---Slicing-Ranges):" data-toc-modified-id="Example-1.1-(Setting-Values---Slicing-Ranges):-2.0.2.1.1">Example 1.1 (Setting Values - Slicing Ranges):</a></span></li><li><span><a href="#Example-1.1.1-(Series):" data-toc-modified-id="Example-1.1.1-(Series):-2.0.2.1.2">Example 1.1.1 (Series):</a></span></li><li><span><a href="#Example-1.1.2-(DataFrame):" data-toc-modified-id="Example-1.1.2-(DataFrame):-2.0.2.1.3">Example 1.1.2 (DataFrame):</a></span></li><li><span><a href="#Example-1.2-(Setting-Values---By-Labels):" data-toc-modified-id="Example-1.2-(Setting-Values---By-Labels):-2.0.2.1.4">Example 1.2 (Setting Values - By Labels):</a></span></li><li><span><a href="#Example-1.2.1-(Series):" data-toc-modified-id="Example-1.2.1-(Series):-2.0.2.1.5">Example 1.2.1 (Series):</a></span></li><li><span><a href="#Example-1.2.2-(DataFrame):" data-toc-modified-id="Example-1.2.2-(DataFrame):-2.0.2.1.6">Example 1.2.2 (DataFrame):</a></span></li><li><span><a href="#Example-1.3-(Setting-Values---By-Position):" data-toc-modified-id="Example-1.3-(Setting-Values---By-Position):-2.0.2.1.7">Example 1.3 (Setting Values - By Position):</a></span></li><li><span><a href="#Example-1.3.1-(Series):" data-toc-modified-id="Example-1.3.1-(Series):-2.0.2.1.8">Example 1.3.1 (Series):</a></span></li><li><span><a href="#Example-1.3.2-(DataFrame):" data-toc-modified-id="Example-1.3.2-(DataFrame):-2.0.2.1.9">Example 1.3.2 (DataFrame):</a></span></li><li><span><a href="#Problem-6:" data-toc-modified-id="Problem-6:-2.0.2.1.10">Problem 6:</a></span></li></ul></li><li><span><a href="#Part-2-(Manipulating-Rows):" data-toc-modified-id="Part-2-(Manipulating-Rows):-2.0.2.2">Part 2 (Manipulating Rows):</a></span><ul class="toc-item"><li><span><a href="#Example-2.1-(Changing-Row-Index---Method-1):" data-toc-modified-id="Example-2.1-(Changing-Row-Index---Method-1):-2.0.2.2.1">Example 2.1 (Changing Row Index - Method 1):</a></span></li><li><span><a href="#Example-2.1.1-(Series):" data-toc-modified-id="Example-2.1.1-(Series):-2.0.2.2.2">Example 2.1.1 (Series):</a></span></li><li><span><a href="#Example-2.1.2-(DataFrame):" data-toc-modified-id="Example-2.1.2-(DataFrame):-2.0.2.2.3">Example 2.1.2 (DataFrame):</a></span></li><li><span><a href="#Problem-7:" data-toc-modified-id="Problem-7:-2.0.2.2.4">Problem 7:</a></span></li><li><span><a href="#Example-2.2-(Changing-Row-Index---Method-2):" data-toc-modified-id="Example-2.2-(Changing-Row-Index---Method-2):-2.0.2.2.5">Example 2.2 (Changing Row Index - Method 2):</a></span></li><li><span><a href="#Example-2.2.1-(Series):" data-toc-modified-id="Example-2.2.1-(Series):-2.0.2.2.6">Example 2.2.1 (Series):</a></span></li><li><span><a href="#Example-2.2.2-(DataFrames):" data-toc-modified-id="Example-2.2.2-(DataFrames):-2.0.2.2.7">Example 2.2.2 (DataFrames):</a></span></li><li><span><a href="#Example-2.3-(Changing-Row-Index---Method-3):" data-toc-modified-id="Example-2.3-(Changing-Row-Index---Method-3):-2.0.2.2.8">Example 2.3 (Changing Row Index - Method 3):</a></span></li><li><span><a href="#Example-2.3.1-(Series):" data-toc-modified-id="Example-2.3.1-(Series):-2.0.2.2.9">Example 2.3.1 (Series):</a></span></li><li><span><a href="#Example-2.3.2-(DataFrames):" data-toc-modified-id="Example-2.3.2-(DataFrames):-2.0.2.2.10">Example 2.3.2 (DataFrames):</a></span></li><li><span><a href="#Example-2.4-(Adding-Rows---Method-1):" data-toc-modified-id="Example-2.4-(Adding-Rows---Method-1):-2.0.2.2.11">Example 2.4 (Adding Rows - Method 1):</a></span></li><li><span><a href="#Example-2.4.1-(DataFrame):" data-toc-modified-id="Example-2.4.1-(DataFrame):-2.0.2.2.12">Example 2.4.1 (DataFrame):</a></span></li><li><span><a href="#Example-2.5-(Adding-Rows---Method-2):" data-toc-modified-id="Example-2.5-(Adding-Rows---Method-2):-2.0.2.2.13">Example 2.5 (Adding Rows - Method 2):</a></span></li><li><span><a href="#Example-2.5.1-(DataFrame):" data-toc-modified-id="Example-2.5.1-(DataFrame):-2.0.2.2.14">Example 2.5.1 (DataFrame):</a></span></li><li><span><a href="#Example-2.6-(Removing-Rows---Method-1):" data-toc-modified-id="Example-2.6-(Removing-Rows---Method-1):-2.0.2.2.15">Example 2.6 (Removing Rows - Method 1):</a></span></li><li><span><a href="#Example-2.6.1-(Series):" data-toc-modified-id="Example-2.6.1-(Series):-2.0.2.2.16">Example 2.6.1 (Series):</a></span></li><li><span><a href="#Example-2.6.2-(DataFrames):" data-toc-modified-id="Example-2.6.2-(DataFrames):-2.0.2.2.17">Example 2.6.2 (DataFrames):</a></span></li><li><span><a href="#Problem-8:" data-toc-modified-id="Problem-8:-2.0.2.2.18">Problem 8:</a></span></li><li><span><a href="#Example-2.7-(Sorting-Rows---Method-1):" data-toc-modified-id="Example-2.7-(Sorting-Rows---Method-1):-2.0.2.2.19">Example 2.7 (Sorting Rows - Method 1):</a></span></li><li><span><a href="#Example-2.7.1-(DataFrames):" data-toc-modified-id="Example-2.7.1-(DataFrames):-2.0.2.2.20">Example 2.7.1 (DataFrames):</a></span></li><li><span><a href="#Example-2.8-(Sorting-Rows---Method-2):" data-toc-modified-id="Example-2.8-(Sorting-Rows---Method-2):-2.0.2.2.21">Example 2.8 (Sorting Rows - Method 2):</a></span></li><li><span><a href="#Example-2.8.1-(DataFrames):" data-toc-modified-id="Example-2.8.1-(DataFrames):-2.0.2.2.22">Example 2.8.1 (DataFrames):</a></span></li><li><span><a href="#Problem-9:" data-toc-modified-id="Problem-9:-2.0.2.2.23">Problem 9:</a></span></li></ul></li><li><span><a href="#Part-3-(Manipulating-Columns):" data-toc-modified-id="Part-3-(Manipulating-Columns):-2.0.2.3">Part 3 (Manipulating Columns):</a></span><ul class="toc-item"><li><span><a href="#Example-3.1-(Changing-Column-Names---Method-1):" data-toc-modified-id="Example-3.1-(Changing-Column-Names---Method-1):-2.0.2.3.1">Example 3.1 (Changing Column Names - Method 1):</a></span></li><li><span><a href="#Example-3.2-(Changing-Column-Names---Method-2):" data-toc-modified-id="Example-3.2-(Changing-Column-Names---Method-2):-2.0.2.3.2">Example 3.2 (Changing Column Names - Method 2):</a></span></li><li><span><a href="#Example-3.3-(Changing-Column-Names---Method-3):" data-toc-modified-id="Example-3.3-(Changing-Column-Names---Method-3):-2.0.2.3.3">Example 3.3 (Changing Column Names - Method 3):</a></span></li><li><span><a href="#Example-3.4-(Adding-Columns---Method-1):" data-toc-modified-id="Example-3.4-(Adding-Columns---Method-1):-2.0.2.3.4">Example 3.4 (Adding Columns - Method 1):</a></span></li><li><span><a href="#Example-3.5-(Adding-Columns---Method-2):" data-toc-modified-id="Example-3.5-(Adding-Columns---Method-2):-2.0.2.3.5">Example 3.5 (Adding Columns - Method 2):</a></span></li><li><span><a href="#Example-3.6-(Removing-Columns---Method-1):" data-toc-modified-id="Example-3.6-(Removing-Columns---Method-1):-2.0.2.3.6">Example 3.6 (Removing Columns - Method 1):</a></span></li><li><span><a href="#Example-3.7-(Removing-Columns---Method-2):" data-toc-modified-id="Example-3.7-(Removing-Columns---Method-2):-2.0.2.3.7">Example 3.7 (Removing Columns - Method 2):</a></span></li><li><span><a href="#Example-3.8-(Removing-Columns---Method-3):" data-toc-modified-id="Example-3.8-(Removing-Columns---Method-3):-2.0.2.3.8">Example 3.8 (Removing Columns - Method 3):</a></span></li><li><span><a href="#Example-3.9-(Sorting-Columns---Method-1):" data-toc-modified-id="Example-3.9-(Sorting-Columns---Method-1):-2.0.2.3.9">Example 3.9 (Sorting Columns - Method 1):</a></span></li><li><span><a href="#Problem-10:" data-toc-modified-id="Problem-10:-2.0.2.3.10">Problem 10:</a></span></li></ul></li></ul></li></ul></li></ul></li></ul></div>

# Lecture 5 - Part 1
## Introduction to Pandas

__Purpose:__ The purpose of this lecture is to explore the extremely powerful Python package - Pandas. We will learn what Pandas is, why it is so useful for Data Scientists, how to use Pandas Series and DataFrames for indexing and manipulation tasks and more advanced capabilities like grouping, aggregating, and sorting.  

__At the end of this lecture you will be able to:__
> 1. Understand what the Pandas Package is and what it can be used for 
> 2. Understand the concept of a Pandas Series and Pandas DataFrame and how they can be created, accessed, and manipulated
> 3. Perform indexing and manipulation (concatenating/merging/joining/reshaping) tasks on Pandas DataFrames
> 4. Perform advanced tasks on Pandas DataFrames such as aggregating and grouping 
> 5. Use Pandas built-in capabilities for Time Series data

## 5.1 Pandas Introduction and Uses

### 5.1.1 What is Pandas?

__Overview:__
- __[Pandas](http://pandas.pydata.org/pandas-docs/stable/index.html):__ Pandas is a Python package that provides fast and flexible data structures that are designed to make working with [relational](https://en.wikipedia.org/wiki/Relational_database) or "labeled" data easy and intuitive
- In the words of [Wes McKinney](https://en.wikipedia.org/wiki/Wes_McKinney), who created Pandas in 2008, and published [this](http://www.dlr.de/sc/Portaldata/15/Resources/dokumente/pyhpc2011/submissions/pyhpc2011_submission_9.pdf) paper in 2011 at PyHPC describing the usefulness and need for Pandas (which was a play on [__Pan__ el __Da__ ta](https://en.wikipedia.org/wiki/Panel_data) )

_"Pandas enables people to analyze and work with data who are not expert computer scientists...the code is intuitive and accessible. Pandas helps people move beyond just using Excel for data analysis"_ 

- When Python was first developed, it was very difficult to perform tasks such as importing CSV files, dealing with spreadsheet-like datasets with rows and columns and merging tables 
- Therefore, Pandas was developed to solve these problems and with the introduction of the DataFrame, Pandas made it possible to do intuitive analysis and exploration in Python that was not possible and still not possible in other languages 
- In recent years, the Pandas Package has become a staple in the Data Scientist's toolbox for some of the following reasons. In fact, Python is one of the most popular programming languages for Data Scientists specifically because of packages such as Pandas and Matplotlib (Lecture 6)
> 1. As a Data Scientist, it is common to work with tabular data where the data in each column is different, known as __hetereogenously-typed data__ (similar to a SQL table or Excel spreadsheet). Pandas DataFrame replicates tabular data and allows you to do everything you would in a spreadsheet, but better and faster 
> 2. As a Data Scientist, it is common to work with time series data that may be ordered or unordered and Pandas has extensive capabilities to treat dates, times, etc. 
> 3. The most time-consuming part of any Data Scientist's job is __[Data Munging](https://en.wikipedia.org/wiki/Data_wrangling)__ (Data Cleaning/Wrangling) and Pandas provides all the necessary tools at your fingertips to do this quicker and cleaner 
> 4. Exploratory Data Analysis is often overlooked in Data Science, but remains one of the most important tasks of a Data Scientist and Pandas provides many easy and intuitive methods to perform data manipulation 

- Now you understand why Data Scientists use the Pandas Package, but what is it about the Pandas Package that allow us, as users of the Pandas Package, to realize these benefits? 
> 1. __Missing Data:__ Pandas handles missing data well (represented as NaN - recall NumPy missing value)
> 2. __Size Mutability:__ Pandas DataFrames are size mutable which means columns and rows can be inserted and deleted 
> 3. __Data Aligment:__ Pandas allows you to align an object to a specific set of labels OR allow Pandas align the data for you
> 4. __Grouping Data:__ Pandas `groupby` function allows both aggregating and transforming of data 
> 5. __Data Access:__ Pandas has extensive capabilities of slicing, indexing and subsetting large data sets 
> 6. __Reshaping Data:__ Pandas has extensive capabilities of merging, joining, and reshaping data 
> 7. __Input/Output:__ Pandas allows easy import and export of flat files such as CSV 
> 8. __Time-Series:__ Pandas has specific Time-Series functionality to work with dates

### 5.1.2 Pandas Basics

### 5.1.2.1 Pandas Data Structures

__Overview:__ 
- Recall that the usefulness of Pandas has to do with its fundamental data structures
- There are 2 types of data structures in Pandas:
> 1. [`Series`](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.html#pandas.Series): Series is a one-dimensional labeled array that is capable of holding any data type (i.e. `int`, `str`, `float`, etc.), but every element is of this same type. The axis labels of a Series are referred to as the __Index__ of the Series
>> - The `pd.Series(data, index)` function which creates a Series data structure, has 2 arguments:<br>
>> a. `index`: The `index` argument is a list of axis labels<br>
>> b. `data`: The `data` argument can be any of the following:
>> > 1. Python dictionary (`dict`)
>> > 2. NumPy Array (`ndarray`)
>> > 3. Scalar value (5)<br> 
> 2. [`DataFrame`](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html): Dataframe is a two-dimensional labeled data structure with columns of potentially different types. It largely resembles a spreadsheet or SQL table. The first axis labels of a Dataframe (rows) are referred to as the __Index__ of the Series, whereas the second axis labels labels of a Dataframe (columns) are referred to as the __Columns__ of the Series
>> - The `pd.DataFrame(data, index, columns)` function which creates a Dataframe data structure, has 3 arguments:<br>
>> a. `index`: The `index` argument is a list of axis 0 labels<br>
>> b. `columns`: The `column` argument is a list of axis 1 labels<br>
>> c. `data`: The `data` argument can be any of the following:
>> > 1. Dictionary of 1D ndarrays, lists, dicts, or Series 
>> > 2. 2-D NumPy Array (`ndarray` object) 
>> > 3. A `Series` object 
>> > 4. Another `DataFrame` object
>> > 5. List of Python dictionaries 
>> > 6. From CSV or Excel file (or any of the possible file formats which can be found [here](http://pandas.pydata.org/pandas-docs/stable/io.html)

__Helpful Points:__
1. Remember that data alignment in Pandas is intrinsic which means that the link between labels and data will not be broken unless you do so explicitly 
2. If you pass an index and/or columns into the function, you guarantee these in the resulting object. Therefore, if you also pass a dictionary, for example, you will lose all the data from the dictionary that does not match with the passed index  
3. If axis labels are not passed into the function, they will be constructed from the input data 
4. We will see examples of creating both types of data structures below 

__Practice:__ Examples of creating Pandas Data Structures in Python

In [1]:
import pandas as pd
import numpy as np

#### Part 1 (Creating Series in Pandas):

##### Example 1.1 (Creating Series from Python Dictionary):

In [2]:
my_dict = {"Allen": 28, "Ryan": 25, "Jackie":32}
my_dict

{'Allen': 28, 'Ryan': 25, 'Jackie': 32}

In [3]:
ex_series_1 = pd.Series(my_dict)
ex_series_1

Allen     28
Jackie    32
Ryan      25
dtype: int64

In [6]:
pd.Series(my_dict, index = ["Michelle", "Allen", "Dad"])

Michelle     NaN
Allen       28.0
Dad          NaN
dtype: float64

See "Helpful Point 2" above which states that if you pass an index into the function (`["Michelle", "Allen", "Dad"]`), you guarantee these indexes in the resulting object, whether they existed in your data or not. We passed in a dictionary of data that only had 1 of 3 indexes the same as the `index` argument. Therefore, the remaining indexes that were passed in, but not in the data are shown with `NaN` to represent "missing data" and the remaining indexes that were in the data, but not passed in, are simply not shown.

##### Example 1.2 (Creating Series from NumPy Array):

In [7]:
my_array = np.arange(2,6)
print(my_array, type(my_array))

[2 3 4 5] <class 'numpy.ndarray'>

In [8]:
pd_1 = pd.Series(my_array) # no index argument so Pandas will infer it 
pd_1

0    2
1    3
2    4
3    5
dtype: int64

In [9]:
type(pd_1)

pandas.core.series.Series

See "Helpful Point 3" above which states that if you do not pass an index into the function, the indexes will be constructed. They are constructed with value from `[0, ..., len(data) - 1]`

In [10]:
pd_2 = pd.Series(my_array, index = ["a", "b", "c", "d"]) # explicitly define index argument 
pd_2

a    2
b    3
c    4
d    5
dtype: int64

In [11]:
pd_2.index # extract the index labels

Index(['a', 'b', 'c', 'd'], dtype='object')

In [14]:
pd_3 = pd.Series(np.arange(4,8), index = pd_2.index) #define the index argument as the index of another array
pd_3                                                 #should be check to see if the index argument is handled as a
                                                     #view or a copy? let's try

a    4
b    5
c    6
d    7
dtype: int64

In [18]:
pd_2 = pd.Series(pd_2, index = ["a", "b", "c", "merp"])
pd_2.index

Index(['a', 'b', 'c', 'merp'], dtype='object')

In [19]:
pd_3.index #here we see that if you define an arrays index from another array, the index is copied and will not synch

Index(['a', 'b', 'c', 'd'], dtype='object')

##### Example 1.3 (Creating Series from Scalar Value):

In [20]:
my_scalar = 10

In [21]:
pd.Series(my_scalar) # no index provided, length equal to 1 by default

0    10
dtype: int64

In [22]:
pd.Series(my_scalar, index = [0,0,0,1,1]) # index provided with length 5, match this length in Series

0    10
0    10
0    10
1    10
1    10
dtype: int64

Two points here:

1. It is possible to have non-unique index values (i.e. index passed in repeats both 0s and 1s). If you peform an operation on a Pandas Series or DataFrame object with non-unique index names and the operation requires unique index names, you will receive an error only at the time. However, most operations don't actually use the index name, therefore it is not that important
2. If you create a Series object based on scalar value, the scalar will be repeated as many times as required to match the length of the index. If no index is given, a default length of 1 occurs

##### Example 1.4 (Using the Series Name Attribute):

In [36]:
my_series = pd.Series(my_scalar, index = [0,0,0,1,1], name = "Name1")

In [37]:
print(my_series.name, '\n') #'\n' prints an empty line below name
print(my_series)

Name1

0    10
0    10
0    10
1    10
1    10
Name: Name1, dtype: int64

In [38]:
my_series_1 = my_series.rename("Name2") # rename the name attribute

In [39]:
print(my_series_1.name,'\n')
print(my_series_1)

Name2

0    10
0    10
0    10
1    10
1    10
Name: Name2, dtype: int64

The Name Attribute will come in handy to understand when we look at DataFrames since each column of a DataFrame is a Series Object with the Name Attribute equal to the column name.

##### Problem 1:

Create a Pandas series called *prob1_ser* using a dictionary, that has the country name as index and population as the values.  Here is the data set (from 2017):

    * China     1,409,517,397
    * India     1,339,180,127
    * USA         324,459,463
    * Indonesia   263,991,379
    * Brazil      209,288,278

Give the data a name equal to $Population$.

In [51]:
### Write code here
natl_pops = {'China':1409517397, 'India':1339180127, 'USA':324459463, 'Indonesia':263991379, 'Bazil':209288278, 'That was':'Easy'}
prob1_ser = pd.Series(natl_pops)
prob1_ser

Bazil         209288278
China        1409517397
India        1339180127
Indonesia     263991379
That was           Easy
USA           324459463
dtype: object

__What is this?!__ Pandas automatically orders the array in alphabetical order of the dictionary's index values? Cool!

#### Part 2 (Creating DataFrames in Pandas):

##### Example 2.1 (Creating DataFrames from Dictionaries):

In [72]:
my_dict = {"ndarray":np.arange(4),
           "List":[10,12,1,2],
           "Series":pd.Series('a', index = ["row_1", "row_2", "row_3", "row_4"])}
my_dict

{'ndarray': array([0, 1, 2, 3]), 'List': [10, 12, 1, 2], 'Series': row_1    a
 row_2    a
 row_3    a
 row_4    a
 dtype: object}

In [73]:
my_df = pd.DataFrame(my_dict)
my_df                                    # Woah. Useful.
                                         # Note that if the the number of rows of the index doesn't match, you get an error

       List Series  ndarray
row_1    10      a        0
row_2    12      a        1
row_3     1      a        2
row_4     2      a        3

In [55]:
type(my_df)

pandas.core.frame.DataFrame

Few points here:

1. We can see that to create this dataframe from a dictionary that has a NumPy Array, List, and Series object, we need all objects to have the same length (4) which corresponds to the number of rows
2. The index of the Series object was explicitly assigned index labels, therefore they were not imputed
3. Each key-value pair in the dictionary becomes a column in the associated DataFrame

In [68]:
my_df.dtypes # types of each column

List        int64
Series     object
ndarray     int64
dtype: object

In [69]:
my_df.index # row names

Index(['row_1', 'row_2', 'row_3', 'row_4'], dtype='object')

In [74]:
my_df.columns # column names

Index(['List', 'Series', 'ndarray'], dtype='object')

##### Example 2.2 (Creating DataFrames from NumPy Arrays):

In [75]:
my_array = np.arange(4).reshape(2,2)
my_array

array([[0, 1],
       [2, 3]])

In [76]:
df_1 = pd.DataFrame(my_array, index = ["row_1", "row_2"], columns = ["column_1", "column_2"])
df_1

       column_1  column_2
row_1         0         1
row_2         2         3

##### Example 2.3 (Creating DataFrames from Series Objects):

In [77]:
my_series = pd.Series(my_scalar, index = [0,0,0,1,1])
my_series

0    10
0    10
0    10
1    10
1    10
dtype: int64

In [78]:
df_2 = pd.DataFrame(my_series, columns = ["column_1"])
df_2

   column_1
0        10
0        10
0        10
1        10
1        10

In [79]:
type(df_2)

pandas.core.frame.DataFrame

##### Example 2.4 (Creating DataFrames from other DataFrames):

In [80]:
df_3 = pd.DataFrame(df_2, columns = ["new_column_1"])
df_3

   new_column_1
0           NaN
0           NaN
0           NaN
1           NaN
1           NaN

Since the column labels were passed into the function, these have now been explicitly defined and the new dataframe must have the same index labels AND column labels, otherwise it will appear as missing data, which it does here (`NaN`)

In [82]:
df_4 = pd.DataFrame(df_2, columns = ["column_1"]) #here we can see it copies all of the data
df_4

   column_1
0        10
0        10
0        10
1        10
1        10

##### Example 2.5 (Creating DataFrames from List of Dictionaries):

In [85]:
my_list = [{"First":"Allen", "Last":"La Croix"},
           {"First":"Ryan", "Last":"Pellegrino"},
           {"First":"Jackie", "Last":"Perrier"}]
my_list

[{'First': 'Allen', 'Last': 'La Croix'},
 {'First': 'Ryan', 'Last': 'Pellegrino'},
 {'First': 'Jackie', 'Last': 'Perrier'}]

In [86]:
pd.DataFrame(my_list, index = ["SpaceInvader_1", "SpaceInvader_2", "SpaceInvader_3"])

                 First        Last
SpaceInvader_1   Allen    La Croix
SpaceInvader_2    Ryan  Pellegrino
SpaceInvader_3  Jackie     Perrier

We can see that each item in the list turns out to be a row in the resulting DataFrame

##### Example 2.6 (Creating DataFrames from CSV):

Pandas has extensive capabilities of reading and writing to different formats. The most common input/output (I/O) that you will perform is with the [CSV](https://en.wikipedia.org/wiki/Comma-separated_values) file format, but Python also supports many other formats shown below, each with their respective reader and writer functions:

> 1. __CSV:__ `read_csv` and `to_csv`
> 2. __MS Excel:__ `read_excel` and `to_excel`
> 3. __Python Pickle:__ `read_pickle` and `to_pickle`
> 4. __SQL:__ `read_sql` and `to_sql`

See below for the CSV file that we will create a DataFrame from: <img src="img29.png">

In [87]:
pd.read_csv("csv_file_for_pandas.csv") # Note: CSV file must be in the same directory as this Jupyter Notebook, otherwise include exact path

   Unnamed: 0    First       Last  Age
0  Employee_1   Gordon        Dri   50
1  Employee_2  Roberto       Reif   25
2  Employee_3    Jerod  Rubalcava   31

The `pd.read_csv` function assumed that Column A was a column in our data instead of the row labels, so we need to fix this below:

In [88]:
pd.read_csv("csv_file_for_pandas.csv", index_col = 0) # specify location of row labels

              First       Last  Age
Employee_1   Gordon        Dri   50
Employee_2  Roberto       Reif   25
Employee_3    Jerod  Rubalcava   31

##### Problem 2:

Create a Pandas DataFrame called *prob2_df* using a list of dictionaries that has 3 columns and 5 rows.  The column names are *Country Name*, *Population* and *Size* (which is in $km^2$).

      Country Name   Population          Size
    
    * China	   1,409,517,397     9,572,900
    * India       1,339,180,127     3,287,263
    * USA           324,459,463     9,629,091
    * Indonesia     263,991,379     1,904,556
    * Brazil        209,288,278     8,511,965

In [84]:
### Write code here
prob2_df = pd.DataFrame(
                [{'Country Name':'China', 'Population':1409517397, 'Size':9572900},
                 {'Country Name':'India', 'Population':1339180127, 'Size':3287263},
                 {'Country Name':'Usa', 'Population':324459463, 'Size':9629091},
                 {'Country Name':'Indonesia', 'Population':263991379, 'Size':1904556},
                 {'Country Name':'Brazil', 'Population':209288278, 'Size':8511965}],)

prob2_df

  Country Name  Population     Size
0        China  1409517397  9572900
1        India  1339180127  3287263
2          Usa   324459463  9629091
3    Indonesia   263991379  1904556
4       Brazil   209288278  8511965

More fantastic examples of creating DataFrames from other objects, such as lists, can be found here along with examples of Row-Oriented vs Column Oriented DataFrames: http://pbpython.com/pandas-list-dict.html

### 5.1.2.2 Inspecting Pandas Data Structures

__Overview:__
- Pandas offers many ways to "inspect" Data Structures which become paramount when peforming Exploratory Data Analysis with Pandas 
- The following are useful ways of inspecting Pandas Data Structures where `obj` is either a Series or DataFrame Object
> 1. __Dimensions:__ Dimensions can be accessed using `len(obj)`, `obj.shape`, and `obj.size`
> 2. __Row Labels:__ Row labels can be accessed using `obj.index`, `obj.index.name`
> 3. __Column Labels:__ (Only for DataFrames) Column labels can be accessed using `obj.columns`, `obj.columns.values`, `obj.columns.values.tolist()`, `obj.columns.tolist()`
> 4. __Name Labels:__ (Only for Series, unless accessing specific columns) Name labels can be accessed using `obj.name`
> 5. __Data Values:__ Data values can be accessed using `obj.values` 
> 6. __Data Type:__ Data types can be accessed using `obj.dtypes`
> 7. __Data Quick Look:__  Data quick looks can be accessed using `obj.head(n)`, `obj.tail(n)`
> 8. __Data Summary:__ Data summary can be completed by `obj.describe`

__Helpful Points:__
1. It is possible to inspect both Series and DataFrames, however DataFrames have some additional functions for inspection given that they have an additional dimension and attributes 
2. Pandas Series and DataFrames will be explored separately below

__Practice:__ Examples of Inspecting Pandas Data Structures in Python

#### Part 1 (Inspecting Pandas Series):

In [3]:
import pandas as pd
my_series_1 = pd.Series([10, 3.2, 6, 1], index = ["row_1", "row_2", "row_3", "row_4"], name = "Series_1")
my_series_1

row_1    10.0
row_2     3.2
row_3     6.0
row_4     1.0
Name: Series_1, dtype: float64

##### Example 1.1 (Dimensions):

In [4]:
len(my_series_1)

4

In [5]:
my_series_1.shape

(4,)

In [6]:
my_series_1.size

4

##### Example 1.2 (Row Labels):

In [7]:
my_series_1.index
# compare to   list(my_series_1.index)

Index(['row_1', 'row_2', 'row_3', 'row_4'], dtype='object')

In [8]:
list(my_series_1.index)

['row_1', 'row_2', 'row_3', 'row_4']

##### Example 1.3 (Name Labels):

In [9]:
my_series_1.name

'Series_1'

##### Example 1.4 (Data Values):

In [10]:
print(my_series_1.values)
type(my_series_1.values)

[10.   3.2  6.   1. ]

numpy.ndarray

Intersting? Yes. The values of a Pandas series is a numpy array.

##### Example 1.5 (Data Type):

In [15]:
my_series_1.dtypes

dtype('float64')

##### Example 1.6 (Data Quick Look):

In [17]:
my_series_1.head(2)

row_1    10.0
row_2     3.2
Name: Series_1, dtype: float64

In [18]:
my_series_1.tail(3)

row_2    3.2
row_3    6.0
row_4    1.0
Name: Series_1, dtype: float64

In [23]:
my_series_1.sample(2) #This gives a random sample from the data. Hmmmm.

row_4    1.0
row_2    3.2
Name: Series_1, dtype: float64

##### Example 1.7 (Data Summary):

In [30]:
my_series_1.describe()

count     4.000000
mean      5.050000
std       3.882868
min       1.000000
25%       2.650000
50%       4.600000
75%       7.000000
max      10.000000
Name: Series_1, dtype: float64

In [31]:
list(my_series_1.describe())

[4.0, 5.05, 3.882868355567398, 1.0, 2.6500000000000004, 4.6, 7.0, 10.0]

#### Side Work: Working with CSV files and JSON Data

##### Reader Objects
To read data from a CSV file with the csv module, you need to create a `Reader` object. A `Reader` object lets you iterate over lines in the CSV file.

In [37]:
import csv
my_csv = open("csv_file_for_pandas.csv") #can't pass string directly to csv.reader
csv_reader = csv.reader(my_csv)
csv_data = list(csv_reader)
print(csv_reader)
csv_data

<_csv.reader object at 0x111e4b278>

[['', 'First', 'Last', 'Age'],
 ['Employee_1', 'Gordon', 'Dri', '50'],
 ['Employee_2', 'Roberto', 'Reif', '25'],
 ['Employee_3', 'Jerod', 'Rubalcava', '31']]

In [39]:
#Since we have this csv as a list of lists, we can access rows and columns: csv_data[row][col]
csv_data[0][1]

'First'

##### Reading with a For Loop
By using a for loop, one can avoid having to load an entire csv into memory at once. This is great for working with large files.

In [64]:
#we can also read data from reader objects in a loop
csv_reader = csv.reader(my_csv)
index = 0
for row in csv_data:
    print('Row #' + str(index + 1) + '' + str(row))
    index += 1

Row #1['', 'First', 'Last', 'Age']
Row #2['Employee_1', 'Gordon', 'Dri', '50']
Row #3['Employee_2', 'Roberto', 'Reif', '25']
Row #4['Employee_3', 'Jerod', 'Rubalcava', '31']

##### Writing and Editing CSV Files

And is used extensively for the remainder of this part of the curriculum to customize and explore the provided content.

In [86]:
#delete file first to avoid any errors from experimenting and writing over it repeatedly
import os
try: os.remove('csv_file_for_pandas.csv')
except: pass

In [87]:
my_csv = open('csv_file_for_pandas.csv', 'w+', newline='') #opening in the 'w+' mode truncates the file
#alternatively, open it in 'w' mode and use my_csv.truncate()
my_csv.truncate() # we'll do it anyway for good measure
csv_writer = csv.writer(my_csv)
csv_writer.writerow(['','First','Middle','Beard Style'])
csv_writer.writerow(['Dad','Allen','James','Wizard'])
csv_writer.writerow(['Son','Ryan','Patrick','Battle Dwarf'])
csv_writer.writerow(['Mom','Michele','Leigh','None'])
csv_writer.writerow(['Son','Allen','Michael','Middle-class Hobbit'])
csv_writer.writerow(['Dog','BamBam','Doggo','N/A'])
my_csv.close()

In [88]:
my_csv = open("csv_file_for_pandas.csv") 
csv_reader = csv.reader(my_csv)
csv_data = list(csv_reader)
print(csv_reader)
csv_data

<_csv.reader object at 0x111e4beb8>

[['', 'First', 'Middle', 'Beard Style'],
 ['Dad', 'Allen', 'James', 'Wizard'],
 ['Son', 'Ryan', 'Patrick', 'Battle Dwarf'],
 ['Mom', 'Michele', 'Leigh', 'None'],
 ['Son', 'Allen', 'Michael', 'Middle-class Hobbit'],
 ['Dog', 'BamBam', 'Doggo', 'N/A']]

#### Part 2 (Inspecting Pandas DataFrames):

In [89]:
my_df = pd.read_csv("csv_file_for_pandas.csv", index_col = 0)
my_df

       First   Middle          Beard Style
Dad    Allen    James               Wizard
Son     Ryan  Patrick         Battle Dwarf
Mom  Michele    Leigh                 None
Son    Allen  Michael  Middle-class Hobbit
Dog   BamBam    Doggo                  NaN

Interesting: BamBam's beard style returns as NaN due to a non alpha-numeric character.

##### Example 2.1 (Dimensions):

In [90]:
len(my_df)

5

In [91]:
my_df.shape

(5, 3)

In [92]:
my_df.size

15

##### Example 2.2 (Row Labels):

In [93]:
my_df.index

Index(['Dad', 'Son', 'Mom', 'Son', 'Dog'], dtype='object')

##### Example 2.3 (Column Labels):

In [94]:
my_df.columns

Index(['First', 'Middle', 'Beard Style'], dtype='object')

In [95]:
my_df.columns.values

array(['First', 'Middle', 'Beard Style'], dtype=object)

In [96]:
my_df.columns.values.tolist()

['First', 'Middle', 'Beard Style']

In [97]:
my_df.columns.tolist()

['First', 'Middle', 'Beard Style']

##### Example 2.4 (Data Values):

In [98]:
my_df.values

array([['Allen', 'James', 'Wizard'],
       ['Ryan', 'Patrick', 'Battle Dwarf'],
       ['Michele', 'Leigh', 'None'],
       ['Allen', 'Michael', 'Middle-class Hobbit'],
       ['BamBam', 'Doggo', nan]], dtype=object)

##### Example 2.5 (Data Type):

In [99]:
my_df.dtypes

First          object
Middle         object
Beard Style    object
dtype: object

##### Example 2.6 (Data Quick Look):

In [100]:
my_df.head(2)

     First   Middle   Beard Style
Dad  Allen    James        Wizard
Son   Ryan  Patrick  Battle Dwarf

In [101]:
my_df.tail(1)

      First Middle Beard Style
Dog  BamBam  Doggo         NaN

In [102]:
my_df.sample(2)

      First   Middle   Beard Style
Son    Ryan  Patrick  Battle Dwarf
Dog  BamBam    Doggo           NaN

##### Example 2.7 (Data Summary):

Only summarizes the numeric variables.

In [103]:
my_df.describe()

        First Middle Beard Style
count       5      5           4
unique      4      5           4
top     Allen  Leigh      Wizard
freq        2      1           1

##### Example 2.8 (Info):

In [104]:
my_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Dad to Dog
Data columns (total 3 columns):
First          5 non-null object
Middle         5 non-null object
Beard Style    4 non-null object
dtypes: object(3)
memory usage: 160.0+ bytes

##### Problem 3:

Using a Pandas DataFrame and csv module, create a csv file with numerical data and strings for the row and column headers. Print the:
    
    * Number of rows and columns
    * Column Names
    * A sample of 2 rows
    * A summary of the values

In [107]:
### Write code here
try: os.remove('csv_file_2.csv')
except: pass
my_csv2 = open('csv_file_2.csv', 'w+', newline='')
writer = csv.writer(my_csv2)
writer.writerow(['Name','Games Played','Games Won','Game Time'])
writer.writerow(['Cookie Monster','75','2','6'])
writer.writerow(['Darth Vader','6','100','0'])
writer.writerow(['Link','100','100','100'])
writer.writerow(['Max','14','11','237'])
my_csv2.close()

In [120]:
my_df = pd.read_csv('csv_file_2.csv', index_col = 0)
print("Number of rows:",my_df.shape[0],"\n")
print("Number of columns:",my_df.shape[1],"\n")
print("Column titles:", my_df.columns.values,"\n")
print("Data sample:", "\n", my_df.sample(2),"\n")
print("Data summary:", "\n", my_df.describe())

Number of rows: 4

Number of columns: 3

Column titles: ['Games Played' 'Games Won' 'Game Time']

Data sample:
              Games Played  Games Won  Game Time
Name
Darth Vader             6        100          0
Link                  100        100        100

Data summary:
        Games Played   Games Won   Game Time
count      4.000000    4.000000    4.000000
mean      48.750000   53.250000   85.750000
std       46.009963   54.107147  110.744074
min        6.000000    2.000000    0.000000
25%       12.000000    8.750000    4.500000
50%       44.500000   55.500000   53.000000
75%       81.250000  100.000000  134.250000
max      100.000000  100.000000  237.000000

### 5.1.3 Indexing Pandas Data Structures:

__Overview:__ 
- Pandas offers many different techniques to index (access) elements within Data Structures which can be found [here](http://pandas.pydata.org/pandas-docs/stable/indexing.html)
- There are 6 main ways of indexing Pandas data structures:
> 1. __Select by Column Name:__ The syntax of this method is `df[col_name]` and it returns a `Series` object
> 2. __[Select by Label](http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-label):__ This describes __purely label-based indexing__ which selects labels based on what is included in the index of the object. The syntax of this method (for DataFrames) is `df.loc[row_label, column_label]` and it returns a `Series` object. The following provides a list of the possible arguments for the `row_label` and/or `column_label`:
>> a. A single label (i.e. `5` or `a`, but the number `5` is interpreted as the label and NOT as the index (use `.iloc` for this)<br>
>> b. A list or array of labels (i.e. `['a', 'b', 'c']`<br>
>> c. A slice object with labels (i.e. `['a':'f']`, but unlike with other slices in Python, the `stop` argument is included in the slice  
>> d. A boolean array 
> 3. __[Select by Integer Location (Position)](http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-integer):__ This describes __purely integer-based indexing__ which requires an integer (0-based indexing) for input. The syntax of this method is (for DataFrames) `df.iloc[row_number, column_number]` and it returns a `Series` object. The following provides a list of the possible arguments for `row_number` and/or `column_number`:
>> a. An integer (i.e. `5`)<br>
>> b. A list or array of integers (i.e. `[4, 3, 0]`<br>
>> c. A slice object with integers (i.e. `[1:7]`<br>
>> d. A boolean array 
> 4. __[Slicing Ranges](http://pandas.pydata.org/pandas-docs/stable/indexing.html#slicing-ranges):__ The syntax of this method is (for DataFrames) `df[row_number_1:row_number_2]` and it returns a `DataFrame` object. The `[` and `]` operator is responsible for the slicing and this ONLY operates on rows
> 5. __[Boolean Indexing](http://pandas.pydata.org/pandas-docs/stable/indexing.html#boolean-indexing):__ The syntax of this method is (for DataFrames) `df[boolean_vector]` and it returns a `DataFrame` object. This is performed using boolean operators such as `|` for `or`, `&` for `and` and `~` for not and each must be grouped by parantheseses
> 6. __[Indexing with isin](http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-with-isin):__ The syntax of this method is (for DataFrames) `df.isin(values)` and it returns a boolean vector that is true wherever the Series elements exist in the passed list 

__Helpful Points:__
1. Recall in previous lectures how we peformeed indexing in Lists, Strings and other ordered, sequence types. The process with Pandas Data Structures is quite similar with a few minor syntactical differences
2. Both Series and DataFrames can be indexed, naturally though, Series have less functionality

__Practice:__ Examples of Indexing Pandas Data Structures in Python

#### Part 1 (Indexing Method 1 - Select by Column Name):

In [3]:
import pandas as pd
fam_df = my_df = pd.read_csv("csv_file_for_pandas.csv", index_col = 0)
fam_df

       First   Middle          Beard Style
Dad    Allen    James               Wizard
Son     Ryan  Patrick         Battle Dwarf
Mom  Michele    Leigh                 None
Son    Allen  Michael  Middle-class Hobbit
Dog   BamBam    Doggo                  NaN

##### Example 1.1 (Access 1 Column by Name - Method 1):

In [5]:
fam_df["Beard Style"] # 2nd column

Dad                 Wizard
Son           Battle Dwarf
Mom                   None
Son    Middle-class Hobbit
Dog                    NaN
Name: Beard Style, dtype: object

In [6]:
type(fam_df["Beard Style"]) # returns a Series object

pandas.core.series.Series

##### Example 1.2 (Access 1 Column by Name - Method 2):

NOTICE: This option is limited to column names that do not have blank spaces.

In [8]:
fam_df.First # 2nd column

Dad      Allen
Son       Ryan
Mom    Michele
Son      Allen
Dog     BamBam
Name: First, dtype: object

In [9]:
type(fam_df.First) # returns a Series object

pandas.core.series.Series

In [10]:
test = pd.DataFrame([{'First 1':'Papacito','Last_1':'Bandito'},{'First 1':'Luis','Last_1':'Swisse'}])
test

    First 1   Last_1
0  Papacito  Bandito
1      Luis   Swisse

In [11]:
test['First 1']
# test.First 1

0    Papacito
1        Luis
Name: First 1, dtype: object

In [12]:
test['Last_1']
# test.Last_1

0    Bandito
1     Swisse
Name: Last_1, dtype: object

##### Example 1.3 (Access 2 Columns by Names):

In [13]:
fam_df[["First", "Middle"]] # 1st and 2nd column

       First   Middle
Dad    Allen    James
Son     Ryan  Patrick
Mom  Michele    Leigh
Son    Allen  Michael
Dog   BamBam    Doggo

In [14]:
type(fam_df[["First", "Middle"]]) # returns a DataFrame object

pandas.core.frame.DataFrame

#### Part 2 (Indexing Method 2 - Select by Label):

##### Example 2.1 (Access with Single Label - Series):

In [16]:
import numpy as np
series_1 = pd.Series(np.arange(3,8), index = ["a", "b", "c", "d", 4])
series_1

a    3
b    4
c    5
d    6
4    7
dtype: int64

In [17]:
series_1.loc["b"] # 2nd row value

4

In [19]:
#.  series_1.loc[1] # 2nd row value???

__Note to self:__ The above will output a (rather lengthy) error message (in times like these, just skip to the very bottom for the actual error info). The reason this results in an error is because when using `loc`, we are indexing by row label so the number `1` is interpreted as a row label and there is clearly not a row label named `1`.

In [20]:
series_1.loc[4] # no error

7

However, there IS a row label named `4`, therefore we can index with the integer 4. Make sure you understand though, this is NOT integer indexing and the argument `4` is interpreted as a row label and NOT an integer position.

In [22]:
series_1.iloc[1] # more on this later, but we see that .iloc does the job in this case

4

##### Example 2.2 (Access with Single Label - DataFrame):

In [23]:
fam_df

       First   Middle          Beard Style
Dad    Allen    James               Wizard
Son     Ryan  Patrick         Battle Dwarf
Mom  Michele    Leigh                 None
Son    Allen  Michael  Middle-class Hobbit
Dog   BamBam    Doggo                  NaN

In [24]:
fam_df.loc["Dad"] # 1st row

First           Allen
Middle          James
Beard Style    Wizard
Name: Dad, dtype: object

In [25]:
fam_df.loc["Dad", "First"] # 1st row, 1st column

'Allen'

##### Example 2.3 (Access with List of Labels - Series):

In [26]:
series_1

a    3
b    4
c    5
d    6
4    7
dtype: int64

In [27]:
series_1.loc[["a", "c", 4]] # 1st row, 3rd row, last row

a    3
c    5
4    7
dtype: int64

##### Example 2.4 (Access with List of Labels - DataFrame):

In [28]:
fam_df.loc[["Dad", "Mom"]] # 1st row and last row

       First Middle Beard Style
Dad    Allen  James      Wizard
Mom  Michele  Leigh        None

In [31]:
fam_df.loc[["Dad", "Dog"], ["Middle", "Beard Style"]] # 1st row and last row and last two columns

    Middle Beard Style
Dad  James      Wizard
Dog  Doggo         NaN

##### Example 2.5 (Access with Slice Object - Series):

In [32]:
series_1.loc["b":"d"] # 2nd to 4th row, inclusive

b    4
c    5
d    6
dtype: int64

##### Example 2.6 (Access with Slice Object - DataFrame):

In [35]:
fam_df.loc["Mom":"Dog"] # inclusive slicing

       First   Middle          Beard Style
Mom  Michele    Leigh                 None
Son    Allen  Michael  Middle-class Hobbit
Dog   BamBam    Doggo                  NaN

Notice how the `stop` argument in the slice `"Mom":"Dog"` is included in the result

In [37]:
fam_df.loc["Mom":"Dog", "Middle":] # inclusive with columns

      Middle          Beard Style
Mom    Leigh                 None
Son  Michael  Middle-class Hobbit
Dog    Doggo                  NaN

Notice how the slice `"Middle":` actually includes the endpoint, which is not the same as regular slicing in Python

In [38]:
fam_df.loc["Dad":"Dog", ["First", "Beard Style"]] # mix slice object with list of labels

       First          Beard Style
Dad    Allen               Wizard
Son     Ryan         Battle Dwarf
Mom  Michele                 None
Son    Allen  Middle-class Hobbit
Dog   BamBam                  NaN

##### Example 2.7 (Access with Boolean Array - Series):

In [39]:
series_1

a    3
b    4
c    5
d    6
4    7
dtype: int64

In [40]:
series_1.loc["a"] > 5

False

In [41]:
series_1 > 5

a    False
b    False
c    False
d     True
4     True
dtype: bool

In [42]:
series_1[series_1 > 5]

d    6
4    7
dtype: int64

##### Example 2.8 (Access with Boolean Array - DataFrame):

In [46]:
my_df = pd.read_csv('csv_file_2.csv', index_col = 0)
my_df

                Games Played  Games Won  Game Time
Name
Cookie Monster            75          2          6
Darth Vader                6        100          0
Link                     100        100        100
Max                       14         11        237

In [47]:
my_df.loc[:, "Games Won"] > 30

Name
Cookie Monster    False
Darth Vader        True
Link               True
Max               False
Name: Games Won, dtype: bool

In [49]:
my_df.loc[my_df.loc[:, "Games Won"] >30]

             Games Played  Games Won  Game Time
Name
Darth Vader             6        100          0
Link                  100        100        100

##### Example 2.9 (Access Scalar Values):

Indexing the traditional way as we saw above is very versatile, but that comes with a downside - which is that it takes a bit of time to figure out which of the many options are being asked. If you want to only access a __[scalar value](https://docs.scipy.org/doc/numpy/reference/arrays.scalars.html#arrays-scalars)__ using position indexing, the best (and fastest) way it to use the `at` method. This method works in the same way as `loc`, in that it requires labels as arguments and not integers.

In [50]:
my_df.loc["Darth Vader", "Games Won"] # method 1

100

In [51]:
my_df.at["Darth Vader", "Games Won"] # method 2

100

In [52]:
fam_df.loc["Dad", "Middle":] # non scalar value is okay for .loc

Middle          James
Beard Style    Wizard
Name: Dad, dtype: object

In [54]:
# fam_df.at["Dad", "Middle":] # non scalar value is not okay for .at

#### Part 3 (Indexing Method 3 - Select by Integer Location):

In [55]:
series_1 = pd.Series(np.arange(3,8), index = ["a", "b", "c", "d", 4])
series_1

a    3
b    4
c    5
d    6
4    7
dtype: int64

In [56]:
employee_df = my_df = pd.read_csv("csv_file_for_pandas.csv", index_col = 0)
employee_df

       First   Middle          Beard Style
Dad    Allen    James               Wizard
Son     Ryan  Patrick         Battle Dwarf
Mom  Michele    Leigh                 None
Son    Allen  Michael  Middle-class Hobbit
Dog   BamBam    Doggo                  NaN

##### Example 3.1 ( Access with Integer - Series):

In [57]:
series_1.iloc[2] # 3rd row

5

In [58]:
series_1.loc["c"]

5

In [59]:
employee_df.iloc[2]

First          Michele
Middle           Leigh
Beard Style       None
Name: Mom, dtype: object

##### Example 3.2 (Access with Integer - DataFrame):

In [61]:
employee_df.iloc[1, 2] # 2nd row, 3rd column

'Battle Dwarf'

In [62]:
employee_df.loc["Son","Beard Style"]

Son           Battle Dwarf
Son    Middle-class Hobbit
Name: Beard Style, dtype: object

##### Example 3.3 (Access with List of Integers - Series):

In [63]:
series_1.iloc[[1,2,4]] # 2nd, 3rd and 5th rows

b    4
c    5
4    7
dtype: int64

##### Example 3.4 (Access with List of Integers - DataFrame):

In [64]:
employee_df.iloc[[0,2], [1,2]] # 1st row and 3rd row, 2nd and 3rd columns

    Middle Beard Style
Dad  James      Wizard
Mom  Leigh        None

##### Example 3.5 (Access with Slice Object - Series):

In [65]:
series_1.iloc[2:4] # 3rd and 4th rows

c    5
d    6
dtype: int64

In [66]:
series_1.iloc[2:10] # out-of-bound indexing is handled gracefully like we saw in Lecture 2

c    5
d    6
4    7
dtype: int64

In [67]:
series_1.iloc[10:] # out-of-bound indexing is handled gracefully like we saw in Lecture 2

Series([], dtype: int64)

##### Example 3.6 (Access with Slice Object - DataFrame):

In [69]:
employee_df.iloc[1:, :] # 2nd row and all following rows, all columns

       First   Middle          Beard Style
Son     Ryan  Patrick         Battle Dwarf
Mom  Michele    Leigh                 None
Son    Allen  Michael  Middle-class Hobbit
Dog   BamBam    Doggo                  NaN

In [71]:
employee_df.iloc[1:, [0,1,2]] # mix of slice object and list of integers

       First   Middle          Beard Style
Son     Ryan  Patrick         Battle Dwarf
Mom  Michele    Leigh                 None
Son    Allen  Michael  Middle-class Hobbit
Dog   BamBam    Doggo                  NaN

In [72]:
employee_df.iloc[:, 2:8] # out-of-bound indexing is handled gracefully like we saw in Lecture 2

             Beard Style
Dad               Wizard
Son         Battle Dwarf
Mom                 None
Son  Middle-class Hobbit
Dog                  NaN

##### Example 3.7 (Access with Boolean Array - Series):

In [73]:
series_1.iloc[2] > 1

True

##### Example 3.8 (Access with Boolean Array - DataFrame):

In [76]:
my_df = pd.read_csv("csv_file_2.csv", index_col = 0)
my_df.iloc[:, 2] > 35

Name
Cookie Monster    False
Darth Vader       False
Link               True
Max                True
Name: Game Time, dtype: bool

##### Example 3.9 (Access Scalar Values):

Indexing the traditional way as we saw above is very versatile, but that comes with a downside - which is that it takes a bit of time to figure out which of the many options are being asked. If you want to only access a __[scalar value](https://docs.scipy.org/doc/numpy/reference/arrays.scalars.html#arrays-scalars)__ with integer indexing, the best (and fastest) way it to use the `iat` method. This method works in the same way as `iloc`, in that it requires labels as arguments and not integers.

In [77]:
employee_df.iloc[2, 2] # method 1

'None'

In [78]:
employee_df.iat[2, 2] # method 2

'None'

In [79]:
employee_df.iloc[0:2, [0,2]] # non scalar value is okay for .iloc

     First   Beard Style
Dad  Allen        Wizard
Son   Ryan  Battle Dwarf

In [80]:
# employee_df.iat[0:2, [0,2]] # non scalar value is not okay for .at

##### Problem 4:

Using the Pandas DataFrame previously created (*prob2_df*), print the:
    
    * Data in the column "Population"
    * The second row
    * The size of the country in the last row

In [147]:
### Write code here

print(prob2_df.iloc[:,1], "\n\n")
print(prob2_df.iloc[[1],:], "\n\n")
print("The population of Brazil is:",prob2_df.iat[4,2])

0    1409517397
1    1339180127
2     324459463
3     263991379
4     209288278
Name: Population, dtype: int64


  Country Name  Population     Size
1        India  1339180127  3287263


The population of Brazil is: 8511965

#### Part 4 (Indexing Method 4 - Slicing Ranges):

In [128]:
series_1 = pd.Series(np.arange(3,8), index = ["a", "b", "c", "d", 4])
series_1

a    3
b    4
c    5
d    6
4    7
dtype: int64

##### Example 4.1 (Slicing Ranges - Series):

In [129]:
# start = 2, stop = 5, step = 1
series_1[2:4] # 3rd row to 5th row (not inclusive)

c    5
d    6
dtype: int64

In [130]:
# start = 0, stop = 4, step = 2
series_1[::2] # every other row

a    3
c    5
4    7
dtype: int64

In [131]:
# start = 4, stop = 0, step = -1 
series_1[::-1] # reverse the rows

4    7
d    6
c    5
b    4
a    3
dtype: int64

##### Example 4.2 (Slicing Ranges - DataFrames):

In [138]:
import csv
my_csv = open('csv_file_for_pandas.csv', 'w+', newline='') #opening in the 'w+' mode truncates the file
#alternatively, open it in 'w' mode and use my_csv.truncate()
my_csv.truncate() # we'll do it anyway for good measure
csv_writer = csv.writer(my_csv)
csv_writer.writerow(['','First','Middle','Beard Style', 'Age'])
csv_writer.writerow(['Dad','Allen','James','Wizard', '51'])
csv_writer.writerow(['Son','Ryan','Patrick','Battle Dwarf', '25'])
csv_writer.writerow(['Mom','Michele','Leigh','None','52'])
csv_writer.writerow(['Son','Allen','Michael','Middle-class Hobbit','28'])
csv_writer.writerow(['Dog','BamBam','Doggo','N/A','7'])
my_csv.close()

In [139]:
my_csv = open("csv_file_for_pandas.csv") 
csv_reader = csv.reader(my_csv)
csv_data = list(csv_reader)
print(csv_reader)
csv_data

<_csv.reader object at 0x1123afcf8>

[['', 'First', 'Middle', 'Beard Style', 'Age'],
 ['Dad', 'Allen', 'James', 'Wizard', '51'],
 ['Son', 'Ryan', 'Patrick', 'Battle Dwarf', '25'],
 ['Mom', 'Michele', 'Leigh', 'None', '52'],
 ['Son', 'Allen', 'Michael', 'Middle-class Hobbit', '28'],
 ['Dog', 'BamBam', 'Doggo', 'N/A', '7']]

In [140]:
employee_df = my_df = pd.read_csv("csv_file_for_pandas.csv", index_col = 0)
employee_df

       First   Middle          Beard Style  Age
Dad    Allen    James               Wizard   51
Son     Ryan  Patrick         Battle Dwarf   25
Mom  Michele    Leigh                 None   52
Son    Allen  Michael  Middle-class Hobbit   28
Dog   BamBam    Doggo                  NaN    7

In [141]:
employee_df[1:2] # 2nd row, returns a DataFrame

    First   Middle   Beard Style  Age
Son  Ryan  Patrick  Battle Dwarf   25

In [142]:
employee_df.iloc[1] # 2nd row, returns a Series

First                  Ryan
Middle              Patrick
Beard Style    Battle Dwarf
Age                      25
Name: Son, dtype: object

In [143]:
employee_df[::2] # every other row

       First Middle Beard Style  Age
Dad    Allen  James      Wizard   51
Mom  Michele  Leigh        None   52
Dog   BamBam  Doggo         NaN    7

In [144]:
employee_df[::-1] # reverse the rows

       First   Middle          Beard Style  Age
Dog   BamBam    Doggo                  NaN    7
Son    Allen  Michael  Middle-class Hobbit   28
Mom  Michele    Leigh                 None   52
Son     Ryan  Patrick         Battle Dwarf   25
Dad    Allen    James               Wizard   51

Notice that when slicing ranges using the `[` and `]` operator, without `loc` or `iloc`, the slicing acts on the row since and was designed like this since it is such a common operation. Note that you can't access rows AND columns here as we are just subsetting rows. If you would like to access rows AND columns, use `iloc` or `loc`.

#### Part 5 (Indexing Method 5 - Boolean Indexing):

##### Example 5.1 (Boolean Indexing - Series):

In [148]:
series_1[series_1 > 4] # all rows greater than 4

c    5
d    6
4    7
dtype: int64

In [149]:
series_1[(series_1 > 3) & (series_1 < 5)] # all rows greater than 3 AND less than 5

b    4
dtype: int64

In [150]:
series_1[~(series_1 == 4)] # all rows not equal to 0

a    3
c    5
d    6
4    7
dtype: int64

##### Example 5.2 (Boolean Indexing - DataFrames):

In [151]:
employee_df[employee_df["Age"] > 30] # all rows with age greater than 30

       First Middle Beard Style  Age
Dad    Allen  James      Wizard   51
Mom  Michele  Leigh        None   52

In [153]:
employee_df[(employee_df["Age"] > 30) & (employee_df["Age"] < 55)] # all rows with age greater than 30

       First Middle Beard Style  Age
Dad    Allen  James      Wizard   51
Mom  Michele  Leigh        None   52

In [154]:
employee_df[~(employee_df["First"] == "Allen")] # all rows where first name is not equal to Gordon

       First   Middle   Beard Style  Age
Son     Ryan  Patrick  Battle Dwarf   25
Mom  Michele    Leigh          None   52
Dog   BamBam    Doggo           NaN    7

In [155]:
employee_df[employee_df["First"] != "Allen"] # all rows where first name is not equal to Gordon

       First   Middle   Beard Style  Age
Son     Ryan  Patrick  Battle Dwarf   25
Mom  Michele    Leigh          None   52
Dog   BamBam    Doggo           NaN    7

##### Problem 5:

Using the Pandas DataFrame previously created (*prob2_df*), print:
    
    * A series that shows True or False for countries with Sizes greater than 3,500,000
    * A series that shows True or False for countries with Sizes greater than 3,500,000 and Populations smaller than 350,000,000
    * A data frame that only shows the rows for countries with Sizes greater than 3,500,000 and Populations smaller than 350,000,000

In [194]:
#print(prob2_df, "\n")
print(prob2_df.loc[:, "Size"] > 3500000, "\n")
print((prob2_df.loc[:, "Size"] > 3500000) & (prob2_df.loc[:, "Population"] < 350000000), "\n")
print(prob2_df[(prob2_df.loc[:, "Size"] > 3500000) & (prob2_df.loc[:, "Population"] < 350000000)], "\n")

# reference from above, where these methods were first exemplified:
# my_df.loc[:, "Games Won"] > 30
# my_df.loc[my_df.loc[:, "Games Won"] >30]

0     True
1    False
2     True
3    False
4     True
Name: Size, dtype: bool

0    False
1    False
2     True
3    False
4     True
dtype: bool

  Country Name  Population     Size
2          Usa   324459463  9629091
4       Brazil   209288278  8511965

# Part 6 (Indexing Method 6 - Using isin):

In [195]:
series_1 = pd.Series(np.arange(3,8), index = ["a", "b", "c", "d", 4])
series_1

a    3
b    4
c    5
d    6
4    7
dtype: int64

##### Example 6.1 (Using isin - Series):

In [196]:
series_1.isin([3,6,7])

a     True
b    False
c    False
d     True
4     True
dtype: bool

In [197]:
series_1[series_1.isin([3,6,7])]

a    3
d    6
4    7
dtype: int64

##### Example 6.2 (Using isin - DataFrames):

In [198]:
employee_df = my_df = pd.read_csv("csv_file_for_pandas.csv", index_col = 0)
employee_df

       First   Middle          Beard Style  Age
Dad    Allen    James               Wizard   51
Son     Ryan  Patrick         Battle Dwarf   25
Mom  Michele    Leigh                 None   52
Son    Allen  Michael  Middle-class Hobbit   28
Dog   BamBam    Doggo                  NaN    7

In [199]:
values = ["Allen", "Michele", "Ryan", 31] # criteria spans multiple columns, find rows that meet this multi-part criteria 
employee_df.isin(values)

     First  Middle  Beard Style    Age
Dad   True   False        False  False
Son   True   False        False  False
Mom   True   False        False  False
Son   True   False        False  False
Dog  False   False        False  False

In [200]:
values = {'First': ['BamBam', 'Michele'], 'Age': [28]} # match certain values with certain columns
employee_df.isin(values)

     First  Middle  Beard Style    Age
Dad  False   False        False  False
Son  False   False        False  False
Mom   True   False        False  False
Son  False   False        False   True
Dog   True   False        False  False

### 5.1.4 Manipulating Pandas Data Structures:

### 5.1.4.1 Simple Manipulation of Pandas Data Structures:

__Overview:__
- Pandas offers many useful ways to manipulate both Series and DataFrames:

> /1. __Setting Values:__ Pandas offers a few different methods of setting values:
>> a. Using __Slicing Ranges__ (i.e. `df[:5] = 0`)<br>
>> b. Using __Labels__ (i.e. `df.loc["a":] = 0` or `df.at["a":] = 0`)<br>
>> c. Using __Position__ (i.e. `df.iloc[:3] = 0` or `df.iat[:3] = 0`)<br>

> /2. __Manipulating Rows:__ Pandas offers many different methods to manipulate rows:

>> a. __Changing Row Index:__ 
>> > 1. Renaming the row index (`df.rename(index=)`)
>> > 2. Setting the row index back to 0-based indexing (`df.reset_index(drop=True)`), etc.
>> > 3. Re-indexing labels (`df.reindex(index=)`) 

>> b. __Adding Rows:__
>> > 1. Inserting row within the DataFrame (`pd.concat()`)
>> > 2. Adding row at the bottom of the DataFrame (`df.append()` or `df.loc[len(df)] = val`)

>> c. __Removing Rows:__
>> > 1. Removing rows based on row index (`df.drop(df.index[])` or `df.drop([row_name])`)

>> d. __Sorting Rows:__
>> > 1. Sorting rows based on column values (`df.sort_values(by = ["col_name_1", "col_name_1"])`)
>> > 2. Sorting rows based on labels (`df.sort_index(axis=0)`)

> /3. __Manipulating Columns:__ Pandas offers many different methods to manipulate columns:

>> a. __Changing Column Names:__ 
>> > 1. Explicitly assign the column names (`df.columns = ["new_col_1", "new_col_2"]`)
>> > 2. Renaming the columns (`df.rename(columns=)`
>> > 3. Re-indexing column names (`df.reindex(columns=)`) 

>> b. __Adding Columns:__
>> > 1. Inserting column within the DataFrame (`df.insert(column_position, column = "new_col_name", value = )`)
>> > 2. Adding column to the end of the DataFrame (`df["new_col_name"] = pd.Series()`)

>> c. __Removing Columns:__
>> > 1. Deleting column using `del` (`del df["col_name"]`)
>> > 2. Deleting column using `pop` (`df.pop("col_name")`)
>> > 3. Removing columns using `drop` (`df.drop(["col_name_1", "col_name_5"], axis = 1)`)

>> d. __Sorting Columns:__
>> > 1. Sorting columns based on column names (`df.sort_index(axis=1)`)

__Helpful Points:__
1. Remember, there are always more than one way to do something in Python and this is especially true with changing, adding, and removing rows/columns in Pandas Series and DataFrames 
2. Don't worry if you can't remember all these possibilities now, be sure to come back and review this list as needed
3. Many of these functions mentioned above act "in-place" which means they perform their operation on the actual object itself 

__Practice:__ Examples of Simple Row/Column Manipulation of Pandas Series and DataFrames in Python

#### Part 1 (Setting Values):

##### Example 1.1 (Setting Values - Slicing Ranges):

##### Example 1.1.1 (Series):

In [201]:
series_1 = pd.Series(np.arange(3,8), index = ["a", "b", "c", "d", 4])
series_1

a    3
b    4
c    5
d    6
4    7
dtype: int64

In [202]:
series_1[:2] = 100 # setting values in first 2 rows 
series_1

a    100
b    100
c      5
d      6
4      7
dtype: int64

##### Example 1.1.2 (DataFrame):

In [203]:
employee_df = my_df = pd.read_csv("csv_file_for_pandas.csv", index_col = 0)

In [204]:
employee_df[0:2] = "New" # setting values in first 2 rows
employee_df

       First   Middle          Beard Style  Age
Dad      New      New                  New  New
Son      New      New                  New  New
Mom  Michele    Leigh                 None   52
Son    Allen  Michael  Middle-class Hobbit   28
Dog   BamBam    Doggo                  NaN    7

##### Example 1.2 (Setting Values - By Labels):

##### Example 1.2.1 (Series):

In [205]:
series_1 = pd.Series(np.arange(3,8), index = ["a", "b", "c", "d", 4])

In [206]:
series_1.loc["a":"d"] = 5 # setting values in first 4 rows using loc 
series_1

a    5
b    5
c    5
d    5
4    7
dtype: int64

In [207]:
series_1.at[4] = 100 # setting scalar value in last row using at 
series_1

a      5
b      5
c      5
d      5
4    100
dtype: int64

##### Example 1.2.2 (DataFrame):

In [208]:
employee_df = my_df = pd.read_csv("csv_file_for_pandas.csv", index_col = 0)

In [210]:
employee_df.loc["Dad":"Mom"] = "New" # setting values using loc 
employee_df

      First   Middle          Beard Style  Age
Dad     New      New                  New  New
Son     New      New                  New  New
Mom     New      New                  New  New
Son   Allen  Michael  Middle-class Hobbit   28
Dog  BamBam    Doggo                  NaN    7

In [212]:
employee_df.at["Dog"] = "New" # setting value in first row using at
employee_df

     First   Middle          Beard Style  Age
Dad    New      New                  New  New
Son    New      New                  New  New
Mom    New      New                  New  New
Son  Allen  Michael  Middle-class Hobbit   28
Dog    New      New                  New  New

##### Example 1.3 (Setting Values - By Position):

##### Example 1.3.1 (Series):

In [213]:
series_1 = pd.Series(np.arange(3,8), index = ["a", "b", "c", "d", 4])

In [214]:
series_1.iloc[:2] = 21 # setting values in first 2 rows using iloc 
series_1

a    21
b    21
c     5
d     6
4     7
dtype: int64

In [215]:
series_1.iat[3] = 100 # setting value in 4th row using iat
series_1

a     21
b     21
c      5
d    100
4      7
dtype: int64

##### Example 1.3.2 (DataFrame):

In [216]:
employee_df = my_df = pd.read_csv("csv_file_for_pandas.csv", index_col = 0)

In [217]:
employee_df.iloc[2:] = "New" # setting value in 3rd row using iloc
employee_df

     First   Middle   Beard Style  Age
Dad  Allen    James        Wizard   51
Son   Ryan  Patrick  Battle Dwarf   25
Mom    New      New           New  New
Son    New      New           New  New
Dog    New      New           New  New

##### Problem 6:

Using the Pandas DataFrame previously created (*prob2_df*):
    
    * Change Brazil's population to 250,000,000
    * Change China's size to 9,580,000

In [226]:
#before:
prob2_dict = [{"Country Name":"China", "Population" : 1409517397, "Size" : 9572900},
              {"Country Name":"India", "Population" : 1339180127, "Size" : 3287263},
              {"Country Name":"USA", "Population" : 324459463, "Size" : 9629091},
              {"Country Name":"Indonesia", "Population" : 263991379, "Size" : 1904556},
              {"Country Name":"Brazil", "Population" : 209288278, "Size" : 8511965}]
prob2_df = pd.DataFrame(prob2_dict)
prob2_df

  Country Name  Population     Size
0        China  1409517397  9572900
1        India  1339180127  3287263
2          USA   324459463  9629091
3    Indonesia   263991379  1904556
4       Brazil   209288278  8511965

In [228]:
### Write code here
#after:

prob2_df.at[4,"Size"], prob2_df.at[0,"Size"] = 250000000, 9580000
prob2_df

  Country Name  Population       Size
0        China  1409517397    9580000
1        India  1339180127    3287263
2          USA   324459463    9629091
3    Indonesia   263991379    1904556
4       Brazil   209288278  250000000

#### Part 2 (Manipulating Rows):

##### Example 2.1 (Changing Row Index - Method 1):

Method 1 is renaming the row index (`df.rename(index=)`)

##### Example 2.1.1 (Series):

Documentation: https://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.rename.html

In [229]:
series_1 = pd.Series(np.arange(3,8), index = ["a", "b", "c", "d", 4])
series_1

a    3
b    4
c    5
d    6
4    7
dtype: int64

In [230]:
series_1.rename({"a":"A", "b":"B", "c":"C", "d":"D", 4:"four"}) # map old index to new index

A       3
B       4
C       5
D       6
four    7
dtype: int64

Super rad!

##### Example 2.1.2 (DataFrame):

Documentation: https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.rename.html

In [231]:
employee_df = my_df = pd.read_csv("csv_file_for_pandas.csv", index_col = 0)

In [234]:
employee_df.rename({"Dad":"Legal", "Mom":"HR"})# map old row index to new row index

         First   Middle          Beard Style  Age
Legal    Allen    James               Wizard   51
Son       Ryan  Patrick         Battle Dwarf   25
HR     Michele    Leigh                 None   52
Son      Allen  Michael  Middle-class Hobbit   28
Dog     BamBam    Doggo                  NaN    7

##### Problem 7:

Using the Pandas DataFrame previously created (*prob2_df*):
    
    * Rename the indices to the first three letters of each country (e.g. 'Chi', 'Ind', 'USA', etc.) and assign the output to a new data frame called prob7_df

In [262]:
#before:
prob2_dict = [{"Country Name":"China", "Population" : 1409517397, "Size" : 9572900},
              {"Country Name":"India", "Population" : 1339180127, "Size" : 3287263},
              {"Country Name":"USA", "Population" : 324459463, "Size" : 9629091},
              {"Country Name":"Indonesia", "Population" : 263991379, "Size" : 1904556},
              {"Country Name":"Brazil", "Population" : 209288278, "Size" : 8511965}]
prob2_df = pd.DataFrame(prob2_dict)
prob2_df

  Country Name  Population     Size
0        China  1409517397  9572900
1        India  1339180127  3287263
2          USA   324459463  9629091
3    Indonesia   263991379  1904556
4       Brazil   209288278  8511965

In [263]:
### Write code here

prob7_df, prob7_df['Country Name'] = prob2_df.copy(deep = True), prob2_df['Country Name'].apply(lambda x: x[0:3])
prob7_df

  Country Name  Population     Size
0          Chi  1409517397  9572900
1          Ind  1339180127  3287263
2          USA   324459463  9629091
3          Ind   263991379  1904556
4          Bra   209288278  8511965

Very pleased with this beautiful example of efficiency in Python, which employs a lambda function to deep copy the library in a single line of code.

##### Example 2.2 (Changing Row Index - Method 2):

Method 2 is renaming the row index (`df.reset_index(drop=True)`)

##### Example 2.2.1 (Series):

Documentation: https://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.reset_index.html

In [264]:
series_1 = pd.Series(np.arange(3,8), index = ["a", "b", "c", "d", 4])
type(series_1)

pandas.core.series.Series

In [265]:
series_1.reset_index() # resets index and adds a column of old index (returns dataframe), and it is not in place

  index  0
0     a  3
1     b  4
2     c  5
3     d  6
4     4  7

##### Example 2.2.2 (DataFrames):

Documentation: https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.reset_index.html#pandas.DataFrame.reset_index

In [266]:
employee_df = my_df = pd.read_csv("csv_file_for_pandas.csv", index_col = 0)

In [267]:
employee_df.reset_index() # resets index and adds a column of old index. It is not in place.

  index    First   Middle          Beard Style  Age
0   Dad    Allen    James               Wizard   51
1   Son     Ryan  Patrick         Battle Dwarf   25
2   Mom  Michele    Leigh                 None   52
3   Son    Allen  Michael  Middle-class Hobbit   28
4   Dog   BamBam    Doggo                  NaN    7

In [268]:
employee_df

       First   Middle          Beard Style  Age
Dad    Allen    James               Wizard   51
Son     Ryan  Patrick         Battle Dwarf   25
Mom  Michele    Leigh                 None   52
Son    Allen  Michael  Middle-class Hobbit   28
Dog   BamBam    Doggo                  NaN    7

##### Example 2.3 (Changing Row Index - Method 3):

Method 3 is re-indexing labels (`df.reindex(index=)`)

##### Example 2.3.1 (Series):

Documentation: https://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.reindex.html

In [270]:
series_1 = pd.Series(np.arange(3,8), index = ["a", "b", "c", "d", 4])
series_1

a    3
b    4
c    5
d    6
4    7
dtype: int64

In [274]:
new_index = ["a", "b", "New_1", "New_2", 4] # change some indexes 
print(series_1.reindex(new_index))
print("\n", series_1)

a        3.0
b        4.0
New_1    NaN
New_2    NaN
4        7.0
dtype: float64

 a    3
b    4
c    5
d    6
4    7
dtype: int64

##### Example 2.3.2 (DataFrames):

Documentation: https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.reindex.html

In [289]:
employee_df = my_df = pd.read_csv("csv_file_for_pandas.csv", index_col = 0)
employee_df

       First   Middle          Beard Style  Age
Dad    Allen    James               Wizard   51
Son     Ryan  Patrick         Battle Dwarf   25
Mom  Michele    Leigh                 None   52
Son    Allen  Michael  Middle-class Hobbit   28
Dog   BamBam    Doggo                  NaN    7

In [286]:
### The following will return a very lengthy error because there are duplicate values in the index!

# new_index = ["Employee_1", "Employee_2", "Employee_3", "Employee_4", "Employee_5"]
# employee_df.reindex(new_index) # change some indexes

## We'll leave that problem to be solved another time.

In [293]:
new_index = ["Country_1", "Country_2", "Country_3", "Country_4", "Country_5"]
prob7_df = prob7_df.reindex(new_index) # change some indexes
prob7_df

          Country Name  Population  Size
Country_1          NaN         NaN   NaN
Country_2          NaN         NaN   NaN
Country_3          NaN         NaN   NaN
Country_4          NaN         NaN   NaN
Country_5          NaN         NaN   NaN

But as we can see, that's now a very nice result. Hmmmm.

##### Example 2.4 (Adding Rows - Method 1):

Method 1 is inserting row within the DataFrame (`pd.concat()`)

##### Example 2.4.1 (DataFrame):

Documentation: https://pandas.pydata.org/pandas-docs/stable/generated/pandas.concat.html

In [301]:
employee_df = my_df = pd.read_csv("csv_file_for_pandas.csv", index_col = 0)
employee_df

       First   Middle          Beard Style  Age
Dad    Allen    James               Wizard   51
Son     Ryan  Patrick         Battle Dwarf   25
Mom  Michele    Leigh                 None   52
Son    Allen  Michael  Middle-class Hobbit   28
Dog   BamBam    Doggo                  NaN    7

In [302]:
new_entry_list = [{"First":"Han", "Middle":"Mansom", "Beard Style":"Soup filter", "Age":31}]
new_entry_df = pd.DataFrame(new_entry_list, index = ["Stepson"], columns = employee_df.columns)
new_entry_df

        First  Middle  Beard Style  Age
Stepson   Han  Mansom  Soup filter   31

In [303]:
# form a new dataframe which is a concatenation of 2 separate dataframes 
employee_df = pd.concat([employee_df, new_entry_df])

employee_df

           First   Middle          Beard Style  Age
Dad        Allen    James               Wizard   51
Son         Ryan  Patrick         Battle Dwarf   25
Mom      Michele    Leigh                 None   52
Son        Allen  Michael  Middle-class Hobbit   28
Dog       BamBam    Doggo                  NaN    7
Stepson      Han   Mansom          Soup filter   31

##### Example 2.5 (Adding Rows - Method 2):

Method 2 is Adding row at the bottom of the DataFrame (`df.append()` or `df.loc[len(df)] = val`)

##### Example 2.5.1 (DataFrame):

Documentation: https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.append.html

In [310]:
employee_df = my_df = pd.read_csv("csv_file_for_pandas.csv", index_col = 0)

In [311]:
new_entry_list = [{"First":"Han", "Middle":"Mansom", "Beard Style":"Soup filter", "Age":31}]
new_entry_df = pd.DataFrame(new_entry_list, index = ["Stepson"], columns = employee_df.columns)
new_entry_df

        First  Middle  Beard Style  Age
Stepson   Han  Mansom  Soup filter   31

In [312]:
# append new dataframe to bottom 
employee_df = employee_df.append(new_entry_df)
employee_df

           First   Middle          Beard Style  Age
Dad        Allen    James               Wizard   51
Son         Ryan  Patrick         Battle Dwarf   25
Mom      Michele    Leigh                 None   52
Son        Allen  Michael  Middle-class Hobbit   28
Dog       BamBam    Doggo                  NaN    7
Stepson      Han   Mansom          Soup filter   31

In [313]:
new_entry_series = pd.Series(["Benson", "Winniford", "Payne", 29], index = ["First", "Middle", "Beard Style", "Age"])
new_entry_series

First             Benson
Middle         Winniford
Beard Style        Payne
Age                   29
dtype: object

In [314]:
# append new series to bottom
employee_df = employee_df.append(new_entry_series, ignore_index = True)
employee_df

     First     Middle          Beard Style  Age
0    Allen      James               Wizard   51
1     Ryan    Patrick         Battle Dwarf   25
2  Michele      Leigh                 None   52
3    Allen    Michael  Middle-class Hobbit   28
4   BamBam      Doggo                  NaN    7
5      Han     Mansom          Soup filter   31
6   Benson  Winniford                Payne   29

In [315]:
employee_df = my_df = pd.read_csv("csv_file_for_pandas.csv", index_col = 0)

In [317]:
employee_df.loc[len(employee_df)] = ["Benson", "Winniford", "Payne", 29]
employee_df

       First     Middle          Beard Style  Age
Dad    Allen      James               Wizard   51
Son     Ryan    Patrick         Battle Dwarf   25
Mom  Michele      Leigh                 None   52
Son    Allen    Michael  Middle-class Hobbit   28
Dog   BamBam      Doggo                  NaN    7
5     Benson  Winniford                Payne   29

In [320]:
employee_df.rename(index=({"Dog":"Cat"}))

       First     Middle          Beard Style  Age
Dad    Allen      James               Wizard   51
Son     Ryan    Patrick         Battle Dwarf   25
Mom  Michele      Leigh                 None   52
Son    Allen    Michael  Middle-class Hobbit   28
Cat   BamBam      Doggo                  NaN    7
5     Benson  Winniford                Payne   29

##### Example 2.6 (Removing Rows - Method 1):

Method 1 is Removing rows based on row index (`df.drop(df.index[])` or `df.drop([row_name])`)

##### Example 2.6.1 (Series):

Documentation: https://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.drop.html

In [321]:
series_1 = pd.Series(np.arange(3,8), index = ["a", "b", "c", "d", 4])

In [322]:
series_1 = series_1.drop(["a"]) # delete the "a" row 
series_1

b    4
c    5
d    6
4    7
dtype: int64

In [323]:
series_1 = series_1.drop(series_1.index[0]) # delete the first index of the new indexes ("b" row)
series_1

c    5
d    6
4    7
dtype: int64

##### Example 2.6.2 (DataFrames):

Documentation: https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.drop.html

In [324]:
employee_df = my_df = pd.read_csv("csv_file_for_pandas.csv", index_col = 0)

In [325]:
employee_df = employee_df.drop(["Son"]) # delete the "Son" rows
employee_df

       First Middle Beard Style  Age
Dad    Allen  James      Wizard   51
Mom  Michele  Leigh        None   52
Dog   BamBam  Doggo         NaN    7

In [326]:
employee_df = employee_df.drop(employee_df.index[1]) # delete the second index of the new indexes ("Employee_3" row)
employee_df

      First Middle Beard Style  Age
Dad   Allen  James      Wizard   51
Dog  BamBam  Doggo         NaN    7

##### Problem 8:

Using the Pandas DataFrame previously created (*prob7_df*):
    
    * Drop China from the data frame
    * Add a new country at the bottom (Russia, Population = 143,989,754, Size = 17,098,246
    * Save the answer on prob8_df

In [334]:
### Write code here
new_entry_series = pd.Series(["Russia", "143989754", "17098246"], index = ["Country Name", "Population", "Size"])
prob8_df = prob8_df.append(new_entry_series, ignore_index = True)
prob8_df = prob2_df.drop(0)
prob8_df

  Country Name  Population      Size
0        India  1339180127   3287263
1          USA   324459463   9629091
2    Indonesia   263991379   1904556
3       Brazil   209288278   8511965
4       Russia   143989754  17098246

##### Example 2.7 (Sorting Rows - Method 1):

Method 1 is Sorting rows based on column values (`df.sort_values(by = ["col_name_1", "col_name_1"])`)

##### Example 2.7.1 (DataFrames):

Documentation: http://pandas.pydata.org/pandas-docs/version/0.17.0/generated/pandas.DataFrame.sort_values.html

In [335]:
employee_df = my_df = pd.read_csv("csv_file_for_pandas.csv", index_col = 0)

In [336]:
employee_df.sort_values(by = "Age") # sort by Age column in ascending fashion

       First   Middle          Beard Style  Age
Dog   BamBam    Doggo                  NaN    7
Son     Ryan  Patrick         Battle Dwarf   25
Son    Allen  Michael  Middle-class Hobbit   28
Dad    Allen    James               Wizard   51
Mom  Michele    Leigh                 None   52

In [337]:
employee_df.sort_values(by = "Middle", ascending = False) # sort by First column in descending fashion

       First   Middle          Beard Style  Age
Son     Ryan  Patrick         Battle Dwarf   25
Son    Allen  Michael  Middle-class Hobbit   28
Mom  Michele    Leigh                 None   52
Dad    Allen    James               Wizard   51
Dog   BamBam    Doggo                  NaN    7

##### Example 2.8 (Sorting Rows - Method 2):

Method 2 is Sorting rows based on labels (`df.sort_index(axis=0)`)

##### Example 2.8.1 (DataFrames):

Documentation: https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.sort_index.html

In [338]:
employee_df = my_df = pd.read_csv("csv_file_for_pandas.csv", index_col = 0)

In [339]:
employee_df.sort_index(axis=0, ascending=False) # sort rows

       First   Middle          Beard Style  Age
Son     Ryan  Patrick         Battle Dwarf   25
Son    Allen  Michael  Middle-class Hobbit   28
Mom  Michele    Leigh                 None   52
Dog   BamBam    Doggo                  NaN    7
Dad    Allen    James               Wizard   51

##### Problem 9:

Using the Pandas DataFrame previously created (*prob8_df*):
    
    * Sort by Population ascending and in place

In [373]:
### Uh-oh! We start off with an error. Why? Because the values int he Population column are objects.
### The Boolean operators > < don't know what to do. So we must convert the column to integers

prob8_df.sort_values(by="Population", ascending=True)

TypeError: '<' not supported between instances of 'str' and 'int'

In [368]:
### Since this data is coming from a CSV spreadsheet the dtype 'O' (object)

prob9_df = prob8_df.copy(deep = True)

prob9_df["Population"] = prob9_df["Population"].infer_objects()
prob9_df.dtypes

Country Name    object
Population      object
Size            object
dtype: object

In [369]:
# Obviously that didn't work, so we try another method:

prob9_df["Population"] = prob9_df["Population"].apply(pd.to_numeric, errors = 'ignore') #using 'coerce' will attempt to force the conversion, but we will use ignore and follow up by checking the dtype as to avoid any data loss

prob9_df.dtypes

Country Name    object
Population       int64
Size            object
dtype: object

In [370]:
# SUCCESS! There is also another method that will successfully force the conversion:
prob9_df = prob8_df.copy(deep = True)

prob9_df["Population"] = prob9_df["Population"].astype(int)

prob9_df.dtypes

Country Name    object
Population       int64
Size            object
dtype: object

In [386]:
### FINALLY we win:

prob9_df = prob9_df.sort_values(by="Population", ascending=True)
prob9_df

  Country Name  Population      Size
4       Russia   143989754  17098246
3       Brazil   209288278   8511965
2    Indonesia   263991379   1904556
1          USA   324459463   9629091
0        India  1339180127   3287263

#### Part 3 (Manipulating Columns):

##### Example 3.1 (Changing Column Names - Method 1):

Method 1 is Explicitly assign the column names (`df.columns = ["new_col_1", "new_col_2"]`)

In [375]:
employee_df = my_df = pd.read_csv("csv_file_for_pandas.csv", index_col = 0)

In [376]:
employee_df.columns = ["First_Name", "Middle_Name", "Beard_Style", "Age_Years"]
employee_df

    First_Name Middle_Name          Beard_Style  Age_Years
Dad      Allen       James               Wizard         51
Son       Ryan     Patrick         Battle Dwarf         25
Mom    Michele       Leigh                 None         52
Son      Allen     Michael  Middle-class Hobbit         28
Dog     BamBam       Doggo                  NaN          7

##### Example 3.2 (Changing Column Names - Method 2):

Method 2 is Renaming the columns (`df.rename(columns=)`

In [377]:
employee_df = my_df = pd.read_csv("csv_file_for_pandas.csv", index_col = 0)

In [378]:
employee_df.rename(columns = {"First":"First_Name", "Last":"Last_Name", "Beard style":"Beard_Style", "Age":"Age_Years"})

    First_Name   Middle          Beard Style  Age_Years
Dad      Allen    James               Wizard         51
Son       Ryan  Patrick         Battle Dwarf         25
Mom    Michele    Leigh                 None         52
Son      Allen  Michael  Middle-class Hobbit         28
Dog     BamBam    Doggo                  NaN          7

##### Example 3.3 (Changing Column Names - Method 3):

Method 3 is Re-indexing column names (`df.reindex(columns=)`)

In [382]:
employee_df = my_df = pd.read_csv("csv_file_for_pandas.csv", index_col = 0)

In [387]:
new_columns = ["First_Name", "Middle_Name", "Beard_Style", "Age_Years"]
employee_df = employee_df.reindex(columns=new_columns)

In [388]:
employee_df ### Uh-oh, why does this happen?

     First_Name  Middle_Name  Beard_Style  Age_Years
Dad         NaN          NaN          NaN        NaN
Son         NaN          NaN          NaN        NaN
Mom         NaN          NaN          NaN        NaN
Son         NaN          NaN          NaN        NaN
Dog         NaN          NaN          NaN        NaN

##### Example 3.4 (Adding Columns - Method 1):

Method 1 is Inserting column within the DataFrame (`df.insert(column_position, column = "new_col_name", value = )`)

In [390]:
employee_df = my_df = pd.read_csv("csv_file_for_pandas.csv", index_col = 0)

In [391]:
employee_df.insert(2, column = "Salary", value = [9999999, 9872348756, 999913379999, 5, 0])
employee_df

       First   Middle        Salary          Beard Style  Age
Dad    Allen    James       9999999               Wizard   51
Son     Ryan  Patrick    9872348756         Battle Dwarf   25
Mom  Michele    Leigh  999913379999                 None   52
Son    Allen  Michael             5  Middle-class Hobbit   28
Dog   BamBam    Doggo             0                  NaN    7

##### Example 3.5 (Adding Columns - Method 2):

Method 2 is Adding column to the end of the DataFrame (`df["new_col_name"] = pd.Series()`)

In [ ]:
employee_df = my_df = pd.read_csv("csv_file_for_pandas.csv", index_col = 0)

In [392]:
new_series = pd.Series([100,200,150,450,0], index = employee_df.index)
new_series

Dad    100
Son    200
Mom    150
Son    450
Dog      0
dtype: int64

In [393]:
employee_df["Salary"] = new_series
employee_df

       First   Middle  Salary          Beard Style  Age
Dad    Allen    James     100               Wizard   51
Son     Ryan  Patrick     200         Battle Dwarf   25
Mom  Michele    Leigh     150                 None   52
Son    Allen  Michael     450  Middle-class Hobbit   28
Dog   BamBam    Doggo       0                  NaN    7

##### Example 3.6 (Removing Columns - Method 1):

Method 1 is Deleting column using `del` (`del df["col_name"]`)

In [394]:
employee_df = my_df = pd.read_csv("csv_file_for_pandas.csv", index_col = 0)

In [395]:
del employee_df["Age"]
employee_df

       First   Middle          Beard Style
Dad    Allen    James               Wizard
Son     Ryan  Patrick         Battle Dwarf
Mom  Michele    Leigh                 None
Son    Allen  Michael  Middle-class Hobbit
Dog   BamBam    Doggo                  NaN

##### Example 3.7 (Removing Columns - Method 2):

Method 2 is Deleting column using `pop` (`df.pop("col_name")`)

In [396]:
employee_df = my_df = pd.read_csv("csv_file_for_pandas.csv", index_col = 0)
employee_df

       First   Middle          Beard Style  Age
Dad    Allen    James               Wizard   51
Son     Ryan  Patrick         Battle Dwarf   25
Mom  Michele    Leigh                 None   52
Son    Allen  Michael  Middle-class Hobbit   28
Dog   BamBam    Doggo                  NaN    7

In [397]:
employee_df.pop("Middle")
employee_df

       First          Beard Style  Age
Dad    Allen               Wizard   51
Son     Ryan         Battle Dwarf   25
Mom  Michele                 None   52
Son    Allen  Middle-class Hobbit   28
Dog   BamBam                  NaN    7

##### Example 3.8 (Removing Columns - Method 3):

Method 3 is Removing columns using `drop` (`df.drop(["col_name_1", "col_name_5"])`)

In [400]:
employee_df = my_df = pd.read_csv("csv_file_for_pandas.csv", index_col = 0)

In [402]:
employee_df.drop(["First", "Middle"], axis = 1)

             Beard Style  Age
Dad               Wizard   51
Son         Battle Dwarf   25
Mom                 None   52
Son  Middle-class Hobbit   28
Dog                  NaN    7

##### Example 3.9 (Sorting Columns - Method 1):

Method 1 is Sorting columns based on column names (`df.sort_index(axis=1)`)

In [403]:
employee_df = my_df = pd.read_csv("csv_file_for_pandas.csv", index_col = 0)

In [404]:
employee_df.sort_index(axis=1)

     Age          Beard Style    First   Middle
Dad   51               Wizard    Allen    James
Son   25         Battle Dwarf     Ryan  Patrick
Mom   52                 None  Michele    Leigh
Son   28  Middle-class Hobbit    Allen  Michael
Dog    7                  NaN   BamBam    Doggo

##### Problem 10:

Using the Pandas DataFrame previously created (*prob8_df*):
    
    * Rename the columns as "Count", "Pop" and "Area""
    * Add a new column called "Pop/Area" and has as values the ratio of the Population over the Area

In [406]:
prob8_df

  Country Name  Population      Size
0        India  1339180127   3287263
1          USA   324459463   9629091
2    Indonesia   263991379   1904556
3       Brazil   209288278   8511965
4       Russia   143989754  17098246

In [411]:
### Write code here

prob8_df = prob8_df.rename(columns = {"Country Name":"Count", "Population":"Pop", "Size":"Area"})
prob8_df

       Count         Pop      Area
0      India  1339180127   3287263
1        USA   324459463   9629091
2  Indonesia   263991379   1904556
3     Brazil   209288278   8511965
4     Russia   143989754  17098246